name: "mxnet-mdoel"
layer {
  name: "data"
  type: "Input"
  top: "data"
  input_param {
    shape {
      dim: 1
      dim: 8
      dim: 1088
      dim: 800
    }
  }
}
layer {
  name: "resnetv1pyr1_hybridsequential0_conv0_fwd"
  type: "Convolution"
  bottom: "data"
  top: "resnetv1pyr1_hybridsequential0_conv0_fwd"
  param {
    name: "data"
  }
  convolution_param {
    num_output: 32
    bias_term: true
    pad: 1
    kernel_size: 3
    group: 1
    stride: 2
    dilation: 1
  }
  bit_bra_w: 3
  bit_bra_y: 2
  bit_bra_bias: 2
}

layer {
  name: "resnetv1pyr1_relu0_fwd"
  type: "ReLU"
  bottom: "resnetv1pyr1_hybridsequential0_conv0_fwd"
  top: "resnetv1pyr1_relu0_fwd"
}
layer {
  name: "resnetv1pyr1_hybridsequential1_conv0_fwd"
  type: "Convolution"
  bottom: "resnetv1pyr1_relu0_fwd"
  top: "resnetv1pyr1_hybridsequential1_conv0_fwd"
  param {
    name: "resnetv1pyr1_hybridsequential1_conv0_weight"
  }
  convolution_param {
    num_output: 32
    bias_term: true
    pad: 1
    kernel_size: 3
    group: 1
    stride: 1
    dilation: 1
  }
  bit_bra_w: 9
  bit_bra_y: 2
  bit_bra_bias: 2
}

layer {
  name: "resnetv1pyr1_relu1_fwd"
  type: "ReLU"
  bottom: "resnetv1pyr1_hybridsequential1_conv0_fwd"
  top: "resnetv1pyr1_relu1_fwd"
}
layer {
  name: "resnetv1pyr1_hybridsequential2_conv0_fwd"
  type: "Convolution"
  bottom: "resnetv1pyr1_relu1_fwd"
  top: "resnetv1pyr1_hybridsequential2_conv0_fwd"
  param {
    name: "resnetv1pyr1_hybridsequential2_conv0_weight"
  }
  convolution_param {
    num_output: 64
    bias_term: true
    pad: 1
    kernel_size: 3
    group: 1
    stride: 1
    dilation: 1
  }
  bit_bra_w: 8
  bit_bra_y: 3
  bit_bra_bias: 3
}
layer {
  name: "resnetv1pyr1_relu2_fwd"
  type: "ReLU"
  bottom: "resnetv1pyr1_hybridsequential2_conv0_fwd"
  top: "resnetv1pyr1_relu2_fwd"
}
layer {
  name: "resnetv1pyr1_pool0_fwd"
  type: "Pooling"
  bottom: "resnetv1pyr1_relu2_fwd"
  top: "resnetv1pyr1_pool0_fwd"
  pooling_param {
    pool: MAX
    kernel_size: 3
    stride: 2
    pad: 0
  }
}
layer {
  name: "resnetv1pyr1_stage_4bottleneckv10_hybridsequential0_conv0_fwd"
  type: "Convolution"
  bottom: "resnetv1pyr1_pool0_fwd"
  top: "resnetv1pyr1_stage_4bottleneckv10_hybridsequential0_conv0_fwd"
  param {
    name: "resnetv1pyr1_stage_4bottleneckv10_hybridsequential0_conv0_weight"
  }
  convolution_param {
    num_output: 32
    bias_term: true
    pad: 0
    kernel_size: 1
    group: 1
    stride: 1
    dilation: 1
  }
  bit_bra_w: 8
  bit_bra_y: 3
  bit_bra_bias: 3
}
layer {
  name: "resnetv1pyr1_stage_4bottleneckv10_relu0_fwd"
  type: "ReLU"
  bottom: "resnetv1pyr1_stage_4bottleneckv10_hybridsequential0_conv0_fwd"
  top: "resnetv1pyr1_stage_4bottleneckv10_relu0_fwd"
}
layer {
  name: "resnetv1pyr1_stage_4bottleneckv10_hybridsequential1_conv0_fwd"
  type: "Convolution"
  bottom: "resnetv1pyr1_stage_4bottleneckv10_relu0_fwd"
  top: "resnetv1pyr1_stage_4bottleneckv10_hybridsequential1_conv0_fwd"
  param {
    name: "resnetv1pyr1_stage_4bottleneckv10_hybridsequential1_conv0_weight"
  }
  convolution_param {
    num_output: 32
    bias_term: true
    pad: 1
    kernel_size: 3
    group: 1
    stride: 1
    dilation: 1
  }
  bit_bra_w: 10
  bit_bra_y: 3
  bit_bra_bias: 3
}
layer {
  name: "resnetv1pyr1_stage_4bottleneckv10_relu1_fwd"
  type: "ReLU"
  bottom: "resnetv1pyr1_stage_4bottleneckv10_hybridsequential1_conv0_fwd"
  top: "resnetv1pyr1_stage_4bottleneckv10_relu1_fwd"
}
layer {
  name: "resnetv1pyr1_stage_4bottleneckv10_hybridsequential2_conv0_fwd"
  type: "Convolution"
  bottom: "resnetv1pyr1_stage_4bottleneckv10_relu1_fwd"
  top: "resnetv1pyr1_stage_4bottleneckv10_hybridsequential2_conv0_fwd"
  param {
    name: "resnetv1pyr1_stage_4bottleneckv10_hybridsequential2_conv0_weight"
  }
  convolution_param {
    num_output: 256
    bias_term: true
    pad: 0
    kernel_size: 1
    group: 1
    stride: 1
    dilation: 1
  }
  bit_bra_w: 8
  bit_bra_y: 3
  bit_bra_bias: 3
}
layer {
  name: "resnetv1pyr1_stage_4_shortcuthybridsequential0_conv0_fwd"
  type: "Convolution"
  bottom: "resnetv1pyr1_pool0_fwd"
  top: "resnetv1pyr1_stage_4_shortcuthybridsequential0_conv0_fwd"
  param {
    name: "resnetv1pyr1_stage_4_shortcuthybridsequential0_conv0_weight"
  }
  
  convolution_param {
    num_output: 256
    bias_term: true
    pad: 0
    kernel_size: 1
    group: 1
    stride: 1
    dilation: 1
  }
  bit_bra_w: 8
  bit_bra_y: 3
  bit_bra_bias: 3
}
layer {
  name: "resnetv1pyr1_stage_4bottleneckv10__plus0"
  type: "Eltwise"
  bottom: "resnetv1pyr1_stage_4bottleneckv10_hybridsequential2_conv0_fwd"
  bottom: "resnetv1pyr1_stage_4_shortcuthybridsequential0_conv0_fwd"
  top: "resnetv1pyr1_stage_4bottleneckv10__plus0"
}
layer {
  name: "resnetv1pyr1_stage_4bottleneckv10_relu2_fwd"
  type: "ReLU"
  bottom: "resnetv1pyr1_stage_4bottleneckv10__plus0"
  top: "resnetv1pyr1_stage_4bottleneckv10_relu2_fwd"
}
layer {
  name: "resnetv1pyr1_stage_4bottleneckv11_hybridsequential0_conv0_fwd"
  type: "Convolution"
  bottom: "resnetv1pyr1_stage_4bottleneckv10_relu2_fwd"
  top: "resnetv1pyr1_stage_4bottleneckv11_hybridsequential0_conv0_fwd"
  param {
    name: "resnetv1pyr1_stage_4bottleneckv11_hybridsequential0_conv0_weight"
  }
  convolution_param {
    num_output: 32
    bias_term: true
    pad: 0
    kernel_size: 1
    group: 1
    stride: 1
    dilation: 1
  }
  bit_bra_w: 10
  bit_bra_y: 3
  bit_bra_bias: 3
}
layer {
  name: "resnetv1pyr1_stage_4bottleneckv11_relu0_fwd"
  type: "ReLU"
  bottom: "resnetv1pyr1_stage_4bottleneckv11_hybridsequential0_conv0_fwd"
  top: "resnetv1pyr1_stage_4bottleneckv11_relu0_fwd"
}
layer {
  name: "resnetv1pyr1_stage_4bottleneckv11_hybridsequential1_conv0_fwd"
  type: "Convolution"
  bottom: "resnetv1pyr1_stage_4bottleneckv11_relu0_fwd"
  top: "resnetv1pyr1_stage_4bottleneckv11_hybridsequential1_conv0_fwd"
  param {
    name: "resnetv1pyr1_stage_4bottleneckv11_hybridsequential1_conv0_weight"
  }
  convolution_param {
    num_output: 32
    bias_term: true
    pad: 1
    kernel_size: 3
    group: 1
    stride: 1
    dilation: 1
  }
  bit_bra_w: 9
  bit_bra_y: 3
  bit_bra_bias: 3
}
layer {
  name: "resnetv1pyr1_stage_4bottleneckv11_relu1_fwd"
  type: "ReLU"
  bottom: "resnetv1pyr1_stage_4bottleneckv11_hybridsequential1_conv0_fwd"
  top: "resnetv1pyr1_stage_4bottleneckv11_relu1_fwd"
}
layer {
  name: "resnetv1pyr1_stage_4bottleneckv11_hybridsequential2_conv0_fwd"
  type: "Convolution"
  bottom: "resnetv1pyr1_stage_4bottleneckv11_relu1_fwd"
  top: "resnetv1pyr1_stage_4bottleneckv11_hybridsequential2_conv0_fwd"
  param {
    name: "resnetv1pyr1_stage_4bottleneckv11_hybridsequential2_conv0_weight"
  }
  convolution_param {
    num_output: 256
    bias_term: true
    pad: 0
    kernel_size: 1
    group: 1
    stride: 1
    dilation: 1
  }
  bit_bra_w: 7
  bit_bra_y: 3
  bit_bra_bias: 3
}
layer {
  name: "resnetv1pyr1_stage_4bottleneckv11__plus0"
  type: "Eltwise"
  bottom: "resnetv1pyr1_stage_4bottleneckv11_hybridsequential2_conv0_fwd"
  bottom: "resnetv1pyr1_stage_4bottleneckv10_relu2_fwd"
  top: "resnetv1pyr1_stage_4bottleneckv11__plus0"
}
layer {
  name: "resnetv1pyr1_stage_4bottleneckv11_relu2_fwd"
  type: "ReLU"
  bottom: "resnetv1pyr1_stage_4bottleneckv11__plus0"
  top: "resnetv1pyr1_stage_4bottleneckv11_relu2_fwd"
}
layer {
  name: "resnetv1pyr1_stage_4bottleneckv12_hybridsequential0_conv0_fwd"
  type: "Convolution"
  bottom: "resnetv1pyr1_stage_4bottleneckv11_relu2_fwd"
  top: "resnetv1pyr1_stage_4bottleneckv12_hybridsequential0_conv0_fwd"
  param {
    name: "resnetv1pyr1_stage_4bottleneckv12_hybridsequential0_conv0_weight"
  }
  convolution_param {
    num_output: 32
    bias_term: true
    pad: 0
    kernel_size: 1
    group: 1
    stride: 1
    dilation: 1
  }
  bit_bra_w: 10
  bit_bra_y: 3
  bit_bra_bias: 3
}
layer {
  name: "resnetv1pyr1_stage_4bottleneckv12_relu0_fwd"
  type: "ReLU"
  bottom: "resnetv1pyr1_stage_4bottleneckv12_hybridsequential0_conv0_fwd"
  top: "resnetv1pyr1_stage_4bottleneckv12_relu0_fwd"
}
layer {
  name: "resnetv1pyr1_stage_4bottleneckv12_hybridsequential1_conv0_fwd"
  type: "Convolution"
  bottom: "resnetv1pyr1_stage_4bottleneckv12_relu0_fwd"
  top: "resnetv1pyr1_stage_4bottleneckv12_hybridsequential1_conv0_fwd"
  param {
    name: "resnetv1pyr1_stage_4bottleneckv12_hybridsequential1_conv0_weight"
  }
  convolution_param {
    num_output: 32
    bias_term: true
    pad: 1
    kernel_size: 3
    group: 1
    stride: 1
    dilation: 1
  }
  bit_bra_w: 9
  bit_bra_y: 3
  bit_bra_bias: 3
}
layer {
  name: "resnetv1pyr1_stage_4bottleneckv12_relu1_fwd"
  type: "ReLU"
  bottom: "resnetv1pyr1_stage_4bottleneckv12_hybridsequential1_conv0_fwd"
  top: "resnetv1pyr1_stage_4bottleneckv12_relu1_fwd"
}
layer {
  name: "resnetv1pyr1_stage_4bottleneckv12_hybridsequential2_conv0_fwd"
  type: "Convolution"
  bottom: "resnetv1pyr1_stage_4bottleneckv12_relu1_fwd"
  top: "resnetv1pyr1_stage_4bottleneckv12_hybridsequential2_conv0_fwd"
  param {
    name: "resnetv1pyr1_stage_4bottleneckv12_hybridsequential2_conv0_weight"
  }
  convolution_param {
    num_output: 256
    bias_term: true
    pad: 0
    kernel_size: 1
    group: 1
    stride: 1
    dilation: 1
  }
  bit_bra_w: 8
  bit_bra_y: 3
  bit_bra_bias: 3
}
layer {
  name: "resnetv1pyr1_stage_4bottleneckv12__plus0"
  type: "Eltwise"
  bottom: "resnetv1pyr1_stage_4bottleneckv12_hybridsequential2_conv0_fwd"
  bottom: "resnetv1pyr1_stage_4bottleneckv11_relu2_fwd"
  top: "resnetv1pyr1_stage_4bottleneckv12__plus0"
}
layer {
  name: "resnetv1pyr1_stage_4bottleneckv12_relu2_fwd"
  type: "ReLU"
  bottom: "resnetv1pyr1_stage_4bottleneckv12__plus0"
  top: "resnetv1pyr1_stage_4bottleneckv12_relu2_fwd"
}
layer {
  name: "resnetv1pyr1_pool1_fwd"
  type: "Pooling"
  bottom: "resnetv1pyr1_stage_4bottleneckv12_relu2_fwd"
  top: "resnetv1pyr1_pool1_fwd"
  pooling_param {
    pool: MAX
    kernel_size: 3
    stride: 2
    pad: 0
  }
}
layer {
  name: "resnetv1pyr1_stage_8bottleneckv10_hybridsequential0_conv0_fwd"
  type: "Convolution"
  bottom: "resnetv1pyr1_pool1_fwd"
  top: "resnetv1pyr1_stage_8bottleneckv10_hybridsequential0_conv0_fwd"
  param {
    name: "resnetv1pyr1_stage_8bottleneckv10_hybridsequential0_conv0_weight"
  }
  convolution_param {
    num_output: 128
    bias_term: true
    pad: 0
    kernel_size: 1
    group: 1
    stride: 1
    dilation: 1
  }
  bit_bra_w: 10
  bit_bra_y: 3
  bit_bra_bias: 3
}
layer {
  name: "resnetv1pyr1_stage_8bottleneckv10_relu0_fwd"
  type: "ReLU"
  bottom: "resnetv1pyr1_stage_8bottleneckv10_hybridsequential0_conv0_fwd"
  top: "resnetv1pyr1_stage_8bottleneckv10_relu0_fwd"
}
layer {
  name: "resnetv1pyr1_stage_8bottleneckv10_hybridsequential1_conv0_fwd"
  type: "Convolution"
  bottom: "resnetv1pyr1_stage_8bottleneckv10_relu0_fwd"
  top: "resnetv1pyr1_stage_8bottleneckv10_hybridsequential1_conv0_fwd"
  param {
    name: "resnetv1pyr1_stage_8bottleneckv10_hybridsequential1_conv0_weight"
  }
  convolution_param {
    num_output: 128
    bias_term: true
    pad: 1
    kernel_size: 3
    group: 1
    stride: 1
    dilation: 1
  }
  bit_bra_w: 10
  bit_bra_y: 4
  bit_bra_bias: 4
}
layer {
  name: "resnetv1pyr1_stage_8bottleneckv10_relu1_fwd"
  type: "ReLU"
  bottom: "resnetv1pyr1_stage_8bottleneckv10_hybridsequential1_conv0_fwd"
  top: "resnetv1pyr1_stage_8bottleneckv10_relu1_fwd"
}
layer {
  name: "resnetv1pyr1_stage_8bottleneckv10_hybridsequential2_conv0_fwd"
  type: "Convolution"
  bottom: "resnetv1pyr1_stage_8bottleneckv10_relu1_fwd"
  top: "resnetv1pyr1_stage_8bottleneckv10_hybridsequential2_conv0_fwd"
  param {
    name: "resnetv1pyr1_stage_8bottleneckv10_hybridsequential2_conv0_weight"
  }
  convolution_param {
    num_output: 512
    bias_term: true
    pad: 0
    kernel_size: 1
    group: 1
    stride: 1
    dilation: 1
  }
  bit_bra_w: 8
  bit_bra_y: 3
  bit_bra_bias: 3
}
layer {
  name: "resnetv1pyr1_stage_8_shortcuthybridsequential0_conv0_fwd"
  type: "Convolution"
  bottom: "resnetv1pyr1_pool1_fwd"
  top: "resnetv1pyr1_stage_8_shortcuthybridsequential0_conv0_fwd"
  param {
    name: "resnetv1pyr1_stage_8_shortcuthybridsequential0_conv0_weight"
  }
  convolution_param {
    num_output: 512
    bias_term: true
    pad: 0
    kernel_size: 1
    group: 1
    stride: 1
    dilation: 1
  }
  bit_bra_w: 9
  bit_bra_y: 3
  bit_bra_bias: 3
}
layer {
  name: "resnetv1pyr1_stage_8bottleneckv10__plus0"
  type: "Eltwise"
  bottom: "resnetv1pyr1_stage_8bottleneckv10_hybridsequential2_conv0_fwd"
  bottom: "resnetv1pyr1_stage_8_shortcuthybridsequential0_conv0_fwd"
  top: "resnetv1pyr1_stage_8bottleneckv10__plus0"
}
layer {
  name: "resnetv1pyr1_stage_8bottleneckv10_relu2_fwd"
  type: "ReLU"
  bottom: "resnetv1pyr1_stage_8bottleneckv10__plus0"
  top: "resnetv1pyr1_stage_8bottleneckv10_relu2_fwd"
}
layer {
  name: "resnetv1pyr1_stage_8bottleneckv11_hybridsequential0_conv0_fwd"
  type: "Convolution"
  bottom: "resnetv1pyr1_stage_8bottleneckv10_relu2_fwd"
  top: "resnetv1pyr1_stage_8bottleneckv11_hybridsequential0_conv0_fwd"
  param {
    name: "resnetv1pyr1_stage_8bottleneckv11_hybridsequential0_conv0_weight"
  }
  convolution_param {
    num_output: 64
    bias_term: true
    pad: 0
    kernel_size: 1
    group: 1
    stride: 1
    dilation: 1
  }
  bit_bra_w: 10
  bit_bra_y: 3
  bit_bra_bias: 3
}
layer {
  name: "resnetv1pyr1_stage_8bottleneckv11_relu0_fwd"
  type: "ReLU"
  bottom: "resnetv1pyr1_stage_8bottleneckv11_hybridsequential0_conv0_fwd"
  top: "resnetv1pyr1_stage_8bottleneckv11_relu0_fwd"
}
layer {
  name: "resnetv1pyr1_stage_8bottleneckv11_hybridsequential1_conv0_fwd"
  type: "Convolution"
  bottom: "resnetv1pyr1_stage_8bottleneckv11_relu0_fwd"
  top: "resnetv1pyr1_stage_8bottleneckv11_hybridsequential1_conv0_fwd"
  param {
    name: "resnetv1pyr1_stage_8bottleneckv11_hybridsequential1_conv0_weight"
  }
  convolution_param {
    num_output: 64
    bias_term: true
    pad: 1
    kernel_size: 3
    group: 1
    stride: 1
    dilation: 1
  }
  bit_bra_w: 10
  bit_bra_y: 3
  bit_bra_bias: 3
}
layer {
  name: "resnetv1pyr1_stage_8bottleneckv11_relu1_fwd"
  type: "ReLU"
  bottom: "resnetv1pyr1_stage_8bottleneckv11_hybridsequential1_conv0_fwd"
  top: "resnetv1pyr1_stage_8bottleneckv11_relu1_fwd"
}
layer {
  name: "resnetv1pyr1_stage_8bottleneckv11_hybridsequential2_conv0_fwd"
  type: "Convolution"
  bottom: "resnetv1pyr1_stage_8bottleneckv11_relu1_fwd"
  top: "resnetv1pyr1_stage_8bottleneckv11_hybridsequential2_conv0_fwd"
  param {
    name: "resnetv1pyr1_stage_8bottleneckv11_hybridsequential2_conv0_weight"
  }
  convolution_param {
    num_output: 512
    bias_term: true
    pad: 0
    kernel_size: 1
    group: 1
    stride: 1
    dilation: 1
  }
  bit_bra_w: 8
  bit_bra_y: 3
  bit_bra_bias: 3
}
layer {
  name: "resnetv1pyr1_stage_8bottleneckv11__plus0"
  type: "Eltwise"
  bottom: "resnetv1pyr1_stage_8bottleneckv11_hybridsequential2_conv0_fwd"
  bottom: "resnetv1pyr1_stage_8bottleneckv10_relu2_fwd"
  top: "resnetv1pyr1_stage_8bottleneckv11__plus0"
}
layer {
  name: "resnetv1pyr1_stage_8bottleneckv11_relu2_fwd"
  type: "ReLU"
  bottom: "resnetv1pyr1_stage_8bottleneckv11__plus0"
  top: "resnetv1pyr1_stage_8bottleneckv11_relu2_fwd"
}
layer {
  name: "resnetv1pyr1_stage_8bottleneckv12_hybridsequential0_conv0_fwd"
  type: "Convolution"
  bottom: "resnetv1pyr1_stage_8bottleneckv11_relu2_fwd"
  top: "resnetv1pyr1_stage_8bottleneckv12_hybridsequential0_conv0_fwd"
  param {
    name: "resnetv1pyr1_stage_8bottleneckv12_hybridsequential0_conv0_weight"
  }
  convolution_param {
    num_output: 64
    bias_term: true
    pad: 0
    kernel_size: 1
    group: 1
    stride: 1
    dilation: 1
  }
  bit_bra_w: 10
  bit_bra_y: 3
  bit_bra_bias: 3
}
layer {
  name: "resnetv1pyr1_stage_8bottleneckv12_relu0_fwd"
  type: "ReLU"
  bottom: "resnetv1pyr1_stage_8bottleneckv12_hybridsequential0_conv0_fwd"
  top: "resnetv1pyr1_stage_8bottleneckv12_relu0_fwd"
}
layer {
  name: "resnetv1pyr1_stage_8bottleneckv12_hybridsequential1_conv0_fwd"
  type: "Convolution"
  bottom: "resnetv1pyr1_stage_8bottleneckv12_relu0_fwd"
  top: "resnetv1pyr1_stage_8bottleneckv12_hybridsequential1_conv0_fwd"
  param {
    name: "resnetv1pyr1_stage_8bottleneckv12_hybridsequential1_conv0_weight"
  }
  convolution_param {
    num_output: 64
    bias_term: true
    pad: 1
    kernel_size: 3
    group: 1
    stride: 1
    dilation: 1
  }
  bit_bra_w: 9
  bit_bra_y: 3
  bit_bra_bias: 3
}
layer {
  name: "resnetv1pyr1_stage_8bottleneckv12_relu1_fwd"
  type: "ReLU"
  bottom: "resnetv1pyr1_stage_8bottleneckv12_hybridsequential1_conv0_fwd"
  top: "resnetv1pyr1_stage_8bottleneckv12_relu1_fwd"
}
layer {
  name: "resnetv1pyr1_stage_8bottleneckv12_hybridsequential2_conv0_fwd"
  type: "Convolution"
  bottom: "resnetv1pyr1_stage_8bottleneckv12_relu1_fwd"
  top: "resnetv1pyr1_stage_8bottleneckv12_hybridsequential2_conv0_fwd"
  param {
    name: "resnetv1pyr1_stage_8bottleneckv12_hybridsequential2_conv0_weight"
  }
  convolution_param {
    num_output: 512
    bias_term: true
    pad: 0
    kernel_size: 1
    group: 1
    stride: 1
    dilation: 1
  }
  bit_bra_w: 8
  bit_bra_y: 3
  bit_bra_bias: 3
}
layer {
  name: "resnetv1pyr1_stage_8bottleneckv12__plus0"
  type: "Eltwise"
  bottom: "resnetv1pyr1_stage_8bottleneckv12_hybridsequential2_conv0_fwd"
  bottom: "resnetv1pyr1_stage_8bottleneckv11_relu2_fwd"
  top: "resnetv1pyr1_stage_8bottleneckv12__plus0"
}
layer {
  name: "resnetv1pyr1_stage_8bottleneckv12_relu2_fwd"
  type: "ReLU"
  bottom: "resnetv1pyr1_stage_8bottleneckv12__plus0"
  top: "resnetv1pyr1_stage_8bottleneckv12_relu2_fwd"
}
layer {
  name: "resnetv1pyr1_stage_8bottleneckv13_hybridsequential0_conv0_fwd"
  type: "Convolution"
  bottom: "resnetv1pyr1_stage_8bottleneckv12_relu2_fwd"
  top: "resnetv1pyr1_stage_8bottleneckv13_hybridsequential0_conv0_fwd"
  param {
    name: "resnetv1pyr1_stage_8bottleneckv13_hybridsequential0_conv0_weight"
  }
  convolution_param {
    num_output: 64
    bias_term: true
    pad: 0
    kernel_size: 1
    group: 1
    stride: 1
    dilation: 1
  }
  bit_bra_w: 10
  bit_bra_y: 3
  bit_bra_bias: 3
}
layer {
  name: "resnetv1pyr1_stage_8bottleneckv13_relu0_fwd"
  type: "ReLU"
  bottom: "resnetv1pyr1_stage_8bottleneckv13_hybridsequential0_conv0_fwd"
  top: "resnetv1pyr1_stage_8bottleneckv13_relu0_fwd"
}
layer {
  name: "resnetv1pyr1_stage_8bottleneckv13_hybridsequential1_conv0_fwd"
  type: "Convolution"
  bottom: "resnetv1pyr1_stage_8bottleneckv13_relu0_fwd"
  top: "resnetv1pyr1_stage_8bottleneckv13_hybridsequential1_conv0_fwd"
  param {
    name: "resnetv1pyr1_stage_8bottleneckv13_hybridsequential1_conv0_weight"
  }
  convolution_param {
    num_output: 64
    bias_term: true
    pad: 1
    kernel_size: 3
    group: 1
    stride: 1
    dilation: 1
  }
  bit_bra_w: 9
  bit_bra_y: 3
  bit_bra_bias: 3
}
layer {
  name: "resnetv1pyr1_stage_8bottleneckv13_relu1_fwd"
  type: "ReLU"
  bottom: "resnetv1pyr1_stage_8bottleneckv13_hybridsequential1_conv0_fwd"
  top: "resnetv1pyr1_stage_8bottleneckv13_relu1_fwd"
}
layer {
  name: "resnetv1pyr1_stage_8bottleneckv13_hybridsequential2_conv0_fwd"
  type: "Convolution"
  bottom: "resnetv1pyr1_stage_8bottleneckv13_relu1_fwd"
  top: "resnetv1pyr1_stage_8bottleneckv13_hybridsequential2_conv0_fwd"
  param {
    name: "resnetv1pyr1_stage_8bottleneckv13_hybridsequential2_conv0_weight"
  }
  convolution_param {
    num_output: 512
    bias_term: true
    pad: 0
    kernel_size: 1
    group: 1
    stride: 1
    dilation: 1
  }
  bit_bra_w: 7
  bit_bra_y: 3
  bit_bra_bias: 3
}
layer {
  name: "resnetv1pyr1_stage_8bottleneckv13__plus0"
  type: "Eltwise"
  bottom: "resnetv1pyr1_stage_8bottleneckv13_hybridsequential2_conv0_fwd"
  bottom: "resnetv1pyr1_stage_8bottleneckv12_relu2_fwd"
  top: "resnetv1pyr1_stage_8bottleneckv13__plus0"
}
layer {
  name: "resnetv1pyr1_stage_8bottleneckv13_relu2_fwd"
  type: "ReLU"
  bottom: "resnetv1pyr1_stage_8bottleneckv13__plus0"
  top: "resnetv1pyr1_stage_8bottleneckv13_relu2_fwd"
}
layer {
  name: "resnetv1pyr1_hybridsequential6_conv0_fwd"
  type: "Convolution"
  bottom: "resnetv1pyr1_stage_8bottleneckv13_relu2_fwd"
  top: "resnetv1pyr1_hybridsequential6_conv0_fwd"
  param {
    name: "resnetv1pyr1_hybridsequential6_conv0_weight"
  }
  convolution_param {
    num_output: 128
    bias_term: true
    pad: 0
    kernel_size: 1
    group: 1
    stride: 1
    dilation: 1
  }
  bit_bra_w: 10
  bit_bra_y: 2
  bit_bra_bias: 2
}
layer {
  name: "resnetv1pyr1_pool2_fwd"
  type: "Pooling"
  bottom: "resnetv1pyr1_stage_8bottleneckv13_relu2_fwd"
  top: "resnetv1pyr1_pool2_fwd"
  pooling_param {
    pool: MAX
    kernel_size: 3
    stride: 2
    pad: 0
  }
}
layer {
  name: "resnetv1pyr1_stage_16bottleneckv10_hybridsequential0_conv0_fwd"
  type: "Convolution"
  bottom: "resnetv1pyr1_pool2_fwd"
  top: "resnetv1pyr1_stage_16bottleneckv10_hybridsequential0_conv0_fwd"
  param {
    name: "resnetv1pyr1_stage_16bottleneckv10_hybridsequential0_conv0_weight"
  }
  convolution_param {
    num_output: 256
    bias_term: true
    pad: 0
    kernel_size: 1
    group: 1
    stride: 1
    dilation: 1
  }
  bit_bra_w: 10
  bit_bra_y: 5
  bit_bra_bias: 5
}
layer {
  name: "resnetv1pyr1_stage_16bottleneckv10_relu0_fwd"
  type: "ReLU"
  bottom: "resnetv1pyr1_stage_16bottleneckv10_hybridsequential0_conv0_fwd"
  top: "resnetv1pyr1_stage_16bottleneckv10_relu0_fwd"
}
layer {
  name: "resnetv1pyr1_stage_16bottleneckv10_hybridsequential1_conv0_fwd"
  type: "Convolution"
  bottom: "resnetv1pyr1_stage_16bottleneckv10_relu0_fwd"
  top: "resnetv1pyr1_stage_16bottleneckv10_hybridsequential1_conv0_fwd"
  param {
    name: "resnetv1pyr1_stage_16bottleneckv10_hybridsequential1_conv0_weight"
  }
  convolution_param {
    num_output: 256
    bias_term: true
    pad: 1
    kernel_size: 3
    group: 1
    stride: 1
    dilation: 1
  }
  bit_bra_w: 11
  bit_bra_y: 5
  bit_bra_bias: 5
}
layer {
  name: "resnetv1pyr1_stage_16bottleneckv10_relu1_fwd"
  type: "ReLU"
  bottom: "resnetv1pyr1_stage_16bottleneckv10_hybridsequential1_conv0_fwd"
  top: "resnetv1pyr1_stage_16bottleneckv10_relu1_fwd"
}
layer {
  name: "resnetv1pyr1_stage_16bottleneckv10_hybridsequential2_conv0_fwd"
  type: "Convolution"
  bottom: "resnetv1pyr1_stage_16bottleneckv10_relu1_fwd"
  top: "resnetv1pyr1_stage_16bottleneckv10_hybridsequential2_conv0_fwd"
  param {
    name: "resnetv1pyr1_stage_16bottleneckv10_hybridsequential2_conv0_weight"
  }
  convolution_param {
    num_output: 1024
    bias_term: true
    pad: 0
    kernel_size: 1
    group: 1
    stride: 1
    dilation: 1
  }
  bit_bra_w: 9
  bit_bra_y: 3
  bit_bra_bias: 3
}
layer {
  name: "resnetv1pyr1_stage_16_shortcuthybridsequential0_conv0_fwd"
  type: "Convolution"
  bottom: "resnetv1pyr1_pool2_fwd"
  top: "resnetv1pyr1_stage_16_shortcuthybridsequential0_conv0_fwd"
  param {
    name: "resnetv1pyr1_stage_16_shortcuthybridsequential0_conv0_weight"
  }
  convolution_param {
    num_output: 1024
    bias_term: true
    pad: 0
    kernel_size: 1
    group: 1
    stride: 1
    dilation: 1
  }
  bit_bra_w: 11
  bit_bra_y: 3
  bit_bra_bias: 3
}
layer {
  name: "resnetv1pyr1_stage_16bottleneckv10__plus0"
  type: "Eltwise"
  bottom: "resnetv1pyr1_stage_16bottleneckv10_hybridsequential2_conv0_fwd"
  bottom: "resnetv1pyr1_stage_16_shortcuthybridsequential0_conv0_fwd"
  top: "resnetv1pyr1_stage_16bottleneckv10__plus0"
}
layer {
  name: "resnetv1pyr1_stage_16bottleneckv10_relu2_fwd"
  type: "ReLU"
  bottom: "resnetv1pyr1_stage_16bottleneckv10__plus0"
  top: "resnetv1pyr1_stage_16bottleneckv10_relu2_fwd"
}
layer {
  name: "resnetv1pyr1_stage_16bottleneckv11_hybridsequential0_conv0_fwd"
  type: "Convolution"
  bottom: "resnetv1pyr1_stage_16bottleneckv10_relu2_fwd"
  top: "resnetv1pyr1_stage_16bottleneckv11_hybridsequential0_conv0_fwd"
  param {
    name: "resnetv1pyr1_stage_16bottleneckv11_hybridsequential0_conv0_weight"
  }
  convolution_param {
    num_output: 128
    bias_term: true
    pad: 0
    kernel_size: 1
    group: 1
    stride: 1
    dilation: 1
  }
  bit_bra_w: 10
  bit_bra_y: 4
  bit_bra_bias: 4
}
layer {
  name: "resnetv1pyr1_stage_16bottleneckv11_relu0_fwd"
  type: "ReLU"
  bottom: "resnetv1pyr1_stage_16bottleneckv11_hybridsequential0_conv0_fwd"
  top: "resnetv1pyr1_stage_16bottleneckv11_relu0_fwd"
}
layer {
  name: "resnetv1pyr1_stage_16bottleneckv11_hybridsequential1_conv0_fwd"
  type: "Convolution"
  bottom: "resnetv1pyr1_stage_16bottleneckv11_relu0_fwd"
  top: "resnetv1pyr1_stage_16bottleneckv11_hybridsequential1_conv0_fwd"
  param {
    name: "resnetv1pyr1_stage_16bottleneckv11_hybridsequential1_conv0_weight"
  }
  convolution_param {
    num_output: 128
    bias_term: true
    pad: 1
    kernel_size: 3
    group: 1
    stride: 1
    dilation: 1
  }
  bit_bra_w: 10
  bit_bra_y: 4
  bit_bra_bias: 4
}
layer {
  name: "resnetv1pyr1_stage_16bottleneckv11_relu1_fwd"
  type: "ReLU"
  bottom: "resnetv1pyr1_stage_16bottleneckv11_hybridsequential1_conv0_fwd"
  top: "resnetv1pyr1_stage_16bottleneckv11_relu1_fwd"
}
layer {
  name: "resnetv1pyr1_stage_16bottleneckv11_hybridsequential2_conv0_fwd"
  type: "Convolution"
  bottom: "resnetv1pyr1_stage_16bottleneckv11_relu1_fwd"
  top: "resnetv1pyr1_stage_16bottleneckv11_hybridsequential2_conv0_fwd"
  param {
    name: "resnetv1pyr1_stage_16bottleneckv11_hybridsequential2_conv0_weight"
  }
  convolution_param {
    num_output: 1024
    bias_term: true
    pad: 0
    kernel_size: 1
    group: 1
    stride: 1
    dilation: 1
  }
  bit_bra_w: 9
  bit_bra_y: 3
  bit_bra_bias: 3
}
layer {
  name: "resnetv1pyr1_stage_16bottleneckv11__plus0"
  type: "Eltwise"
  bottom: "resnetv1pyr1_stage_16bottleneckv11_hybridsequential2_conv0_fwd"
  bottom: "resnetv1pyr1_stage_16bottleneckv10_relu2_fwd"
  top: "resnetv1pyr1_stage_16bottleneckv11__plus0"
}
layer {
  name: "resnetv1pyr1_stage_16bottleneckv11_relu2_fwd"
  type: "ReLU"
  bottom: "resnetv1pyr1_stage_16bottleneckv11__plus0"
  top: "resnetv1pyr1_stage_16bottleneckv11_relu2_fwd"
}
layer {
  name: "resnetv1pyr1_stage_16bottleneckv12_hybridsequential0_conv0_fwd"
  type: "Convolution"
  bottom: "resnetv1pyr1_stage_16bottleneckv11_relu2_fwd"
  top: "resnetv1pyr1_stage_16bottleneckv12_hybridsequential0_conv0_fwd"
  param {
    name: "resnetv1pyr1_stage_16bottleneckv12_hybridsequential0_conv0_weight"
  }
  convolution_param {
    num_output: 128
    bias_term: true
    pad: 0
    kernel_size: 1
    group: 1
    stride: 1
    dilation: 1
  }
  bit_bra_w: 10
  bit_bra_y: 5
  bit_bra_bias: 5
}
layer {
  name: "resnetv1pyr1_stage_16bottleneckv12_relu0_fwd"
  type: "ReLU"
  bottom: "resnetv1pyr1_stage_16bottleneckv12_hybridsequential0_conv0_fwd"
  top: "resnetv1pyr1_stage_16bottleneckv12_relu0_fwd"
}
layer {
  name: "resnetv1pyr1_stage_16bottleneckv12_hybridsequential1_conv0_fwd"
  type: "Convolution"
  bottom: "resnetv1pyr1_stage_16bottleneckv12_relu0_fwd"
  top: "resnetv1pyr1_stage_16bottleneckv12_hybridsequential1_conv0_fwd"
  param {
    name: "resnetv1pyr1_stage_16bottleneckv12_hybridsequential1_conv0_weight"
  }
  convolution_param {
    num_output: 128
    bias_term: true
    pad: 1
    kernel_size: 3
    group: 1
    stride: 1
    dilation: 1
  }
  bit_bra_w: 10
  bit_bra_y: 4
  bit_bra_bias: 4
}
layer {
  name: "resnetv1pyr1_stage_16bottleneckv12_relu1_fwd"
  type: "ReLU"
  bottom: "resnetv1pyr1_stage_16bottleneckv12_hybridsequential1_conv0_fwd"
  top: "resnetv1pyr1_stage_16bottleneckv12_relu1_fwd"
}
layer {
  name: "resnetv1pyr1_stage_16bottleneckv12_hybridsequential2_conv0_fwd"
  type: "Convolution"
  bottom: "resnetv1pyr1_stage_16bottleneckv12_relu1_fwd"
  top: "resnetv1pyr1_stage_16bottleneckv12_hybridsequential2_conv0_fwd"
  param {
    name: "resnetv1pyr1_stage_16bottleneckv12_hybridsequential2_conv0_weight"
  }
  convolution_param {
    num_output: 1024
    bias_term: true
    pad: 0
    kernel_size: 1
    group: 1
    stride: 1
    dilation: 1
  }
  bit_bra_w: 9
  bit_bra_y: 3
  bit_bra_bias: 3
}
layer {
  name: "resnetv1pyr1_stage_16bottleneckv12__plus0"
  type: "Eltwise"
  bottom: "resnetv1pyr1_stage_16bottleneckv12_hybridsequential2_conv0_fwd"
  bottom: "resnetv1pyr1_stage_16bottleneckv11_relu2_fwd"
  top: "resnetv1pyr1_stage_16bottleneckv12__plus0"
}
layer {
  name: "resnetv1pyr1_stage_16bottleneckv12_relu2_fwd"
  type: "ReLU"
  bottom: "resnetv1pyr1_stage_16bottleneckv12__plus0"
  top: "resnetv1pyr1_stage_16bottleneckv12_relu2_fwd"
}
layer {
  name: "resnetv1pyr1_hybridsequential4_conv0_fwd"
  type: "Convolution"
  bottom: "resnetv1pyr1_stage_16bottleneckv12_relu2_fwd"
  top: "resnetv1pyr1_hybridsequential4_conv0_fwd"
  param {
    name: "resnetv1pyr1_hybridsequential4_conv0_weight"
  }
  convolution_param {
    num_output: 256
    bias_term: true
    pad: 0
    kernel_size: 1
    group: 1
    stride: 1
    dilation: 1
  }
  bit_bra_w: 11
  bit_bra_y: 2
  bit_bra_bias: 2
}
layer {
  name: "resnetv1pyr1_stage_16_dbottleneckv10_hybridsequential0_conv0_fwd"
  type: "Convolution"
  bottom: "resnetv1pyr1_stage_16bottleneckv12_relu2_fwd"
  top: "resnetv1pyr1_stage_16_dbottleneckv10_hybridsequential0_conv0_fwd"
  param {
    name: "resnetv1pyr1_stage_16_dbottleneckv10_hybridsequential0_conv0_weight"
  }
  convolution_param {
    num_output: 128
    bias_term: true
    pad: 0
    kernel_size: 1
    group: 1
    stride: 1
    dilation: 1
  }
  bit_bra_w: 10
  bit_bra_y: 3
  bit_bra_bias: 3
}
layer {
  name: "resnetv1pyr1_stage_16_dbottleneckv10_relu0_fwd"
  type: "ReLU"
  bottom: "resnetv1pyr1_stage_16_dbottleneckv10_hybridsequential0_conv0_fwd"
  top: "resnetv1pyr1_stage_16_dbottleneckv10_relu0_fwd"
}
layer {
  name: "resnetv1pyr1_stage_16_dbottleneckv10_hybridsequential1_conv0_fwd"
  type: "Convolution"
  bottom: "resnetv1pyr1_stage_16_dbottleneckv10_relu0_fwd"
  top: "resnetv1pyr1_stage_16_dbottleneckv10_hybridsequential1_conv0_fwd"
  param {
    name: "resnetv1pyr1_stage_16_dbottleneckv10_hybridsequential1_conv0_weight"
  }
  convolution_param {
    num_output: 128
    bias_term: true
    pad: 2
    kernel_size: 5
    group: 1
    stride: 1
    dilation: 1
  }
  bit_bra_w: 10
  bit_bra_y: 4
  bit_bra_bias: 4
}
layer {
  name: "resnetv1pyr1_stage_16_dbottleneckv10_relu1_fwd"
  type: "ReLU"
  bottom: "resnetv1pyr1_stage_16_dbottleneckv10_hybridsequential1_conv0_fwd"
  top: "resnetv1pyr1_stage_16_dbottleneckv10_relu1_fwd"
}
layer {
  name: "resnetv1pyr1_stage_16_dbottleneckv10_hybridsequential2_conv0_fwd"
  type: "Convolution"
  bottom: "resnetv1pyr1_stage_16_dbottleneckv10_relu1_fwd"
  top: "resnetv1pyr1_stage_16_dbottleneckv10_hybridsequential2_conv0_fwd"
  param {
    name: "resnetv1pyr1_stage_16_dbottleneckv10_hybridsequential2_conv0_weight"
  }
  convolution_param {
    num_output: 1024
    bias_term: true
    pad: 0
    kernel_size: 1
    group: 1
    stride: 1
    dilation: 1
  }
  bit_bra_w: 8
  bit_bra_y: 3
  bit_bra_bias: 3
}
layer {
  name: "resnetv1pyr1_stage_16_d_shortcuthybridsequential0_conv0_fwd"
  type: "Convolution"
  bottom: "resnetv1pyr1_stage_16bottleneckv12_relu2_fwd"
  top: "resnetv1pyr1_stage_16_d_shortcuthybridsequential0_conv0_fwd"
  param {
    name: "resnetv1pyr1_stage_16_d_shortcuthybridsequential0_conv0_weight"
  }
  convolution_param {
    num_output: 1024
    bias_term: true
    pad: 0
    kernel_size: 1
    group: 1
    stride: 1
    dilation: 1
  }
  bit_bra_w: 10
  bit_bra_y: 3
  bit_bra_bias: 3
}
layer {
  name: "resnetv1pyr1_stage_16_dbottleneckv10__plus0"
  type: "Eltwise"
  bottom: "resnetv1pyr1_stage_16_dbottleneckv10_hybridsequential2_conv0_fwd"
  bottom: "resnetv1pyr1_stage_16_d_shortcuthybridsequential0_conv0_fwd"
  top: "resnetv1pyr1_stage_16_dbottleneckv10__plus0"
}
layer {
  name: "resnetv1pyr1_stage_16_dbottleneckv10_relu2_fwd"
  type: "ReLU"
  bottom: "resnetv1pyr1_stage_16_dbottleneckv10__plus0"
  top: "resnetv1pyr1_stage_16_dbottleneckv10_relu2_fwd"
}
layer {
  name: "resnetv1pyr1_stage_16_dbottleneckv11_hybridsequential0_conv0_fwd"
  type: "Convolution"
  bottom: "resnetv1pyr1_stage_16_dbottleneckv10_relu2_fwd"
  top: "resnetv1pyr1_stage_16_dbottleneckv11_hybridsequential0_conv0_fwd"
  param {
    name: "resnetv1pyr1_stage_16_dbottleneckv11_hybridsequential0_conv0_weight"
  }
  convolution_param {
    num_output: 128
    bias_term: true
    pad: 0
    kernel_size: 1
    group: 1
    stride: 1
    dilation: 1
  }
  bit_bra_w: 10
  bit_bra_y: 3
  bit_bra_bias: 3
}
layer {
  name: "resnetv1pyr1_stage_16_dbottleneckv11_relu0_fwd"
  type: "ReLU"
  bottom: "resnetv1pyr1_stage_16_dbottleneckv11_hybridsequential0_conv0_fwd"
  top: "resnetv1pyr1_stage_16_dbottleneckv11_relu0_fwd"
}
layer {
  name: "resnetv1pyr1_stage_16_dbottleneckv11_hybridsequential1_conv0_fwd"
  type: "Convolution"
  bottom: "resnetv1pyr1_stage_16_dbottleneckv11_relu0_fwd"
  top: "resnetv1pyr1_stage_16_dbottleneckv11_hybridsequential1_conv0_fwd"
  param {
    name: "resnetv1pyr1_stage_16_dbottleneckv11_hybridsequential1_conv0_weight"
  }
  convolution_param {
    num_output: 128
    bias_term: true
    pad: 2
    kernel_size: 5
    group: 1
    stride: 1
    dilation: 1
  }
  bit_bra_w: 10
  bit_bra_y: 3
  bit_bra_bias: 3
}
layer {
  name: "resnetv1pyr1_stage_16_dbottleneckv11_relu1_fwd"
  type: "ReLU"
  bottom: "resnetv1pyr1_stage_16_dbottleneckv11_hybridsequential1_conv0_fwd"
  top: "resnetv1pyr1_stage_16_dbottleneckv11_relu1_fwd"
}
layer {
  name: "resnetv1pyr1_stage_16_dbottleneckv11_hybridsequential2_conv0_fwd"
  type: "Convolution"
  bottom: "resnetv1pyr1_stage_16_dbottleneckv11_relu1_fwd"
  top: "resnetv1pyr1_stage_16_dbottleneckv11_hybridsequential2_conv0_fwd"
  param {
    name: "resnetv1pyr1_stage_16_dbottleneckv11_hybridsequential2_conv0_weight"
  }
  convolution_param {
    num_output: 1024
    bias_term: true
    pad: 0
    kernel_size: 1
    group: 1
    stride: 1
    dilation: 1
  }
  bit_bra_w: 8
  bit_bra_y: 3
  bit_bra_bias: 3
}
layer {
  name: "resnetv1pyr1_stage_16_dbottleneckv11__plus0"
  type: "Eltwise"
  bottom: "resnetv1pyr1_stage_16_dbottleneckv11_hybridsequential2_conv0_fwd"
  bottom: "resnetv1pyr1_stage_16_dbottleneckv10_relu2_fwd"
  top: "resnetv1pyr1_stage_16_dbottleneckv11__plus0"
}
layer {
  name: "resnetv1pyr1_stage_16_dbottleneckv11_relu2_fwd"
  type: "ReLU"
  bottom: "resnetv1pyr1_stage_16_dbottleneckv11__plus0"
  top: "resnetv1pyr1_stage_16_dbottleneckv11_relu2_fwd"
}
layer {
  name: "resnetv1pyr1_stage_16_dbottleneckv12_hybridsequential0_conv0_fwd"
  type: "Convolution"
  bottom: "resnetv1pyr1_stage_16_dbottleneckv11_relu2_fwd"
  top: "resnetv1pyr1_stage_16_dbottleneckv12_hybridsequential0_conv0_fwd"
  param {
    name: "resnetv1pyr1_stage_16_dbottleneckv12_hybridsequential0_conv0_weight"
  }
  convolution_param {
    num_output: 128
    bias_term: true
    pad: 0
    kernel_size: 1
    group: 1
    stride: 1
    dilation: 1
  }
  bit_bra_w: 10
  bit_bra_y: 3
  bit_bra_bias: 3
}
layer {
  name: "resnetv1pyr1_stage_16_dbottleneckv12_relu0_fwd"
  type: "ReLU"
  bottom: "resnetv1pyr1_stage_16_dbottleneckv12_hybridsequential0_conv0_fwd"
  top: "resnetv1pyr1_stage_16_dbottleneckv12_relu0_fwd"
}
layer {
  name: "resnetv1pyr1_stage_16_dbottleneckv12_hybridsequential1_conv0_fwd"
  type: "Convolution"
  bottom: "resnetv1pyr1_stage_16_dbottleneckv12_relu0_fwd"
  top: "resnetv1pyr1_stage_16_dbottleneckv12_hybridsequential1_conv0_fwd"
  param {
    name: "resnetv1pyr1_stage_16_dbottleneckv12_hybridsequential1_conv0_weight"
  }
  convolution_param {
    num_output: 128
    bias_term: true
    pad: 2
    kernel_size: 5
    group: 1
    stride: 1
    dilation: 1
  }
  bit_bra_w: 9
  bit_bra_y: 3
  bit_bra_bias: 3
}
layer {
  name: "resnetv1pyr1_stage_16_dbottleneckv12_relu1_fwd"
  type: "ReLU"
  bottom: "resnetv1pyr1_stage_16_dbottleneckv12_hybridsequential1_conv0_fwd"
  top: "resnetv1pyr1_stage_16_dbottleneckv12_relu1_fwd"
}
layer {
  name: "resnetv1pyr1_stage_16_dbottleneckv12_hybridsequential2_conv0_fwd"
  type: "Convolution"
  bottom: "resnetv1pyr1_stage_16_dbottleneckv12_relu1_fwd"
  top: "resnetv1pyr1_stage_16_dbottleneckv12_hybridsequential2_conv0_fwd"
  param {
    name: "resnetv1pyr1_stage_16_dbottleneckv12_hybridsequential2_conv0_weight"
  }
  convolution_param {
    num_output: 1024
    bias_term: true
    pad: 0
    kernel_size: 1
    group: 1
    stride: 1
    dilation: 1
  }
  bit_bra_w: 8
  bit_bra_y: 3
  bit_bra_bias: 3
}
layer {
  name: "resnetv1pyr1_stage_16_dbottleneckv12__plus0"
  type: "Eltwise"
  bottom: "resnetv1pyr1_stage_16_dbottleneckv12_hybridsequential2_conv0_fwd"
  bottom: "resnetv1pyr1_stage_16_dbottleneckv11_relu2_fwd"
  top: "resnetv1pyr1_stage_16_dbottleneckv12__plus0"
}
layer {
  name: "resnetv1pyr1_stage_16_dbottleneckv12_relu2_fwd"
  type: "ReLU"
  bottom: "resnetv1pyr1_stage_16_dbottleneckv12__plus0"
  top: "resnetv1pyr1_stage_16_dbottleneckv12_relu2_fwd"
}
layer {
  name: "resnetv1pyr1_hybridsequential3_conv0_fwd"
  type: "Convolution"
  bottom: "resnetv1pyr1_stage_16_dbottleneckv12_relu2_fwd"
  top: "resnetv1pyr1_hybridsequential3_conv0_fwd"
  param {
    name: "resnetv1pyr1_hybridsequential3_conv0_weight"
  }
  convolution_param {
    num_output: 256
    bias_term: true
    pad: 0
    kernel_size: 1
    group: 1
    stride: 1
    dilation: 1
  }
  bit_bra_w: 10
  bit_bra_y: 2   # 4
  bit_bra_bias: 2   # 4
}
layer {
  name: "resnetv1pyr1__plus0"
  type: "Eltwise"
  bottom: "resnetv1pyr1_hybridsequential4_conv0_fwd"
  bottom: "resnetv1pyr1_hybridsequential3_conv0_fwd"
  top: "resnetv1pyr1__plus0"
}
layer {
  name: "resnetv1pyr1_hybridsequential5_conv0_fwd"
  type: "Convolution"
  bottom: "resnetv1pyr1__plus0"
  top: "resnetv1pyr1_hybridsequential5_conv0_fwd"
  param {
    name: "resnetv1pyr1_hybridsequential5_conv0_weight"
  }
  convolution_param {
    num_output: 128
    bias_term: true
    pad: 1
    kernel_size: 3
    group: 1
    stride: 1
    dilation: 1
  }
  bit_bra_w: 12
  bit_bra_y: 2   # 3
  bit_bra_bias: 2   # 3
}
layer {
  name: "resnetv1pyr1_upsampling0"
  type: "Deconvolution"
  bottom: "resnetv1pyr1_hybridsequential5_conv0_fwd"
  top: "resnetv1pyr1_upsampling0"
  convolution_param {
    num_output: 128
    pad: 0
    kernel_size: 2
    stride: 2
    weight_filler {
      type: "constant"
      value: 0.0
    }
  }
  
  bit_bra_w: 0
  bit_bra_y: 2   # 3
  bit_bra_bias: 2   # 3
}
layer {
  name: "resnetv1pyr1__plus1"
  type: "Eltwise"
  bottom: "resnetv1pyr1_hybridsequential6_conv0_fwd"
  bottom: "resnetv1pyr1_upsampling0"
  top: "resnetv1pyr1__plus1"
}
layer {
  name: "resnetv1pyr1_hybridsequential7_conv0_fwd"
  type: "Convolution"
  bottom: "resnetv1pyr1__plus1"
  top: "resnetv1pyr1_hybridsequential7_conv0_fwd"
  param {
    name: "resnetv1pyr1_hybridsequential7_conv0_weight"
  }
  convolution_param {
    num_output: 64
    bias_term: true
    pad: 1
    kernel_size: 3
    group: 1
    stride: 1
    dilation: 1
  }
  bit_bra_w: 13
  bit_bra_y: 3
  bit_bra_bias: 3
}
layer {
  name: "resnetv1pyr1_upsampling1"
  type: "Deconvolution"
  bottom: "resnetv1pyr1_hybridsequential7_conv0_fwd"
  top: "resnetv1pyr1_upsampling1"
  convolution_param {
    num_output: 64
    pad: 0
    kernel_size: 2
    stride: 2
    weight_filler {
      type: "constant"
      value: 0.0
    }
  }
  bit_bra_w: 0
  bit_bra_y: 3
  bit_bra_bias: 3
}
layer {
  name: "resnetv1pyr1_hybridsequential8_conv0_fwd"
  type: "Convolution"
  bottom: "resnetv1pyr1_stage_4bottleneckv12_relu2_fwd"
  top: "resnetv1pyr1_hybridsequential8_conv0_fwd"
  param {
    name: "resnetv1pyr1_hybridsequential8_conv0_weight"
  }
  convolution_param {
    num_output: 64
    bias_term: true
    pad: 0
    kernel_size: 1
    group: 1
    stride: 1
    dilation: 1
  }
  bit_bra_w: 11
  bit_bra_y: 3
  bit_bra_bias: 3
}
layer {
  name: "resnetv1pyr1__plus2"
  type: "Eltwise"
  bottom: "resnetv1pyr1_upsampling1"
  bottom: "resnetv1pyr1_hybridsequential8_conv0_fwd"
  top: "resnetv1pyr1__plus2"
}
layer {
  name: "resnetv1pyr1_hybridsequential9_conv0_fwd"
  type: "Convolution"
  bottom: "resnetv1pyr1__plus2"
  top: "resnetv1pyr1_hybridsequential9_conv0_fwd"
  param {
    name: "resnetv1pyr1_hybridsequential9_conv0_weight"
  }
  convolution_param {
    num_output: 64
    bias_term: true
    pad: 1
    kernel_size: 3
    group: 1
    stride: 1
    dilation: 1
  }
  bit_bra_w: 11
  bit_bra_y: 3
  bit_bra_bias: 3
}
layer {
  name: "resnetv1pyr1_share_head_4hybridsequential0_conv0_fwd"
  type: "Convolution"
  bottom: "resnetv1pyr1_hybridsequential9_conv0_fwd"
  top: "resnetv1pyr1_share_head_4hybridsequential0_conv0_fwd"
  param {
    name: "resnetv1pyr1_share_head_4hybridsequential0_conv0_weight"
  }
  convolution_param {
    num_output: 64
    bias_term: true
    pad: 1
    kernel_size: 3
    group: 1
    stride: 1
    dilation: 1
  }
  bit_bra_w: 8
  bit_bra_y: 2
  bit_bra_bias: 2
}
layer {
  name: "resnetv1pyr1_share_head_4relu0_fwd"
  type: "ReLU"
  bottom: "resnetv1pyr1_share_head_4hybridsequential0_conv0_fwd"
  top: "resnetv1pyr1_share_head_4relu0_fwd"
}
layer {
  name: "resnetv1pyr1_cls_head_4hybridsequential0_conv0_fwd"
  type: "Convolution"
  bottom: "resnetv1pyr1_share_head_4relu0_fwd"
  top: "resnetv1pyr1_cls_head_4hybridsequential0_conv0_fwd"
  param {
    name: "resnetv1pyr1_cls_head_4hybridsequential0_conv0_weight"
  }
  convolution_param {
    num_output: 64
    bias_term: true
    pad: 1
    kernel_size: 3
    group: 1
    stride: 1
    dilation: 1
  }
  bit_bra_w: 8
  bit_bra_y: 1
  bit_bra_bias: 1
}
layer {
  name: "resnetv1pyr1_cls_head_4relu0_fwd"
  type: "ReLU"
  bottom: "resnetv1pyr1_cls_head_4hybridsequential0_conv0_fwd"
  top: "resnetv1pyr1_cls_head_4relu0_fwd"
}
layer {
  name: "resnetv1pyr1_cls_head_4hybridsequential1_conv0_fwd"
  type: "Convolution"
  bottom: "resnetv1pyr1_cls_head_4relu0_fwd"
  top: "resnetv1pyr1_cls_head_4hybridsequential1_conv0_fwd"
  param {
    name: "resnetv1pyr1_cls_head_4hybridsequential1_conv0_weight"
  }
  convolution_param {
    num_output: 64
    bias_term: true
    pad: 1
    kernel_size: 3
    group: 1
    stride: 1
    dilation: 1
  }
  bit_bra_w: 8
  bit_bra_y: 1
  bit_bra_bias: 1
}
layer {
  name: "resnetv1pyr1_cls_head_4relu1_fwd"
  type: "ReLU"
  bottom: "resnetv1pyr1_cls_head_4hybridsequential1_conv0_fwd"
  top: "resnetv1pyr1_cls_head_4relu1_fwd"
}
layer {
  name: "resnetv1pyr1_cls_head_4hybridsequential2_conv0_fwd"
  type: "Convolution"
  bottom: "resnetv1pyr1_cls_head_4relu1_fwd"
  top: "resnetv1pyr1_cls_head_4hybridsequential2_conv0_fwd"
  param {
    name: "resnetv1pyr1_cls_head_4hybridsequential2_conv0_weight"
  }
  convolution_param {
    num_output: 4
    bias_term: true
    pad: 0
    kernel_size: 1
    group: 1
    stride: 1
    dilation: 1
  }
  bit_bra_w: 8
  bit_bra_y: 0
  bit_bra_bias: 0
}
layer {
  name: "resnetv1pyr1_share_head_8hybridsequential0_conv0_fwd"
  type: "Convolution"
  bottom: "resnetv1pyr1_hybridsequential7_conv0_fwd"
  top: "resnetv1pyr1_share_head_8hybridsequential0_conv0_fwd"
  param {
    name: "resnetv1pyr1_share_head_8hybridsequential0_conv0_weight"
  }
  convolution_param {
    num_output: 128
    bias_term: true
    pad: 1
    kernel_size: 3
    group: 1
    stride: 1
    dilation: 1
  }
  bit_bra_w: 9
  bit_bra_y: 2
  bit_bra_bias: 2
}
layer {
  name: "resnetv1pyr1_share_head_8relu0_fwd"
  type: "ReLU"
  bottom: "resnetv1pyr1_share_head_8hybridsequential0_conv0_fwd"
  top: "resnetv1pyr1_share_head_8relu0_fwd"
}
layer {
  name: "resnetv1pyr1_cls_head_8hybridsequential0_conv0_fwd"
  type: "Convolution"
  bottom: "resnetv1pyr1_share_head_8relu0_fwd"
  top: "resnetv1pyr1_cls_head_8hybridsequential0_conv0_fwd"
  param {
    name: "resnetv1pyr1_cls_head_8hybridsequential0_conv0_weight"
  }
  convolution_param {
    num_output: 128
    bias_term: true
    pad: 1
    kernel_size: 3
    group: 1
    stride: 1
    dilation: 1
  }
  bit_bra_w: 8
  bit_bra_y: 1
  bit_bra_bias: 1
}
layer {
  name: "resnetv1pyr1_cls_head_8relu0_fwd"
  type: "ReLU"
  bottom: "resnetv1pyr1_cls_head_8hybridsequential0_conv0_fwd"
  top: "resnetv1pyr1_cls_head_8relu0_fwd"
}
layer {
  name: "resnetv1pyr1_cls_head_8hybridsequential1_conv0_fwd"
  type: "Convolution"
  bottom: "resnetv1pyr1_cls_head_8relu0_fwd"
  top: "resnetv1pyr1_cls_head_8hybridsequential1_conv0_fwd"
  param {
    name: "resnetv1pyr1_cls_head_8hybridsequential1_conv0_weight"
  }
  convolution_param {
    num_output: 64
    bias_term: true
    pad: 1
    kernel_size: 3
    group: 1
    stride: 1
    dilation: 1
  }
  bit_bra_w: 8
  bit_bra_y: 2
  bit_bra_bias: 2
}
layer {
  name: "resnetv1pyr1_cls_head_8relu1_fwd"
  type: "ReLU"
  bottom: "resnetv1pyr1_cls_head_8hybridsequential1_conv0_fwd"
  top: "resnetv1pyr1_cls_head_8relu1_fwd"
}
layer {
  name: "resnetv1pyr1_cls_head_8hybridsequential2_conv0_fwd"
  type: "Convolution"
  bottom: "resnetv1pyr1_cls_head_8relu1_fwd"
  top: "resnetv1pyr1_cls_head_8hybridsequential2_conv0_fwd"
  param {
    name: "resnetv1pyr1_cls_head_8hybridsequential2_conv0_weight"
  }
  convolution_param {
    num_output: 4
    bias_term: true
    pad: 0
    kernel_size: 1
    group: 1
    stride: 1
    dilation: 1
  }
  bit_bra_w: 9
  bit_bra_y: 0
  bit_bra_bias: 0
}
layer {
  name: "resnetv1pyr1_share_head_16hybridsequential0_conv0_fwd"
  type: "Convolution"
  bottom: "resnetv1pyr1_hybridsequential5_conv0_fwd"
  top: "resnetv1pyr1_share_head_16hybridsequential0_conv0_fwd"
  param {
    name: "resnetv1pyr1_share_head_16hybridsequential0_conv0_weight"
  }
  convolution_param {
    num_output: 256
    bias_term: true
    pad: 1
    kernel_size: 3
    group: 1
    stride: 1
    dilation: 1
  }
  bit_bra_w: 9
  bit_bra_y: 0
  bit_bra_bias: 0
}
layer {
  name: "resnetv1pyr1_share_head_16relu0_fwd"
  type: "ReLU"
  bottom: "resnetv1pyr1_share_head_16hybridsequential0_conv0_fwd"
  top: "resnetv1pyr1_share_head_16relu0_fwd"
}
layer {
  name: "resnetv1pyr1_cls_head_16hybridsequential0_conv0_fwd"
  type: "Convolution"
  bottom: "resnetv1pyr1_share_head_16relu0_fwd"
  top: "resnetv1pyr1_cls_head_16hybridsequential0_conv0_fwd"
  param {
    name: "resnetv1pyr1_cls_head_16hybridsequential0_conv0_weight"
  }
  convolution_param {
    num_output: 128
    bias_term: true
    pad: 1
    kernel_size: 3
    group: 1
    stride: 1
    dilation: 1
  }
  bit_bra_w: 10
  bit_bra_y: 0
  bit_bra_bias: 0
}
layer {
  name: "resnetv1pyr1_cls_head_16relu0_fwd"
  type: "ReLU"
  bottom: "resnetv1pyr1_cls_head_16hybridsequential0_conv0_fwd"
  top: "resnetv1pyr1_cls_head_16relu0_fwd"
}
layer {
  name: "resnetv1pyr1_cls_head_16hybridsequential1_conv0_fwd"
  type: "Convolution"
  bottom: "resnetv1pyr1_cls_head_16relu0_fwd"
  top: "resnetv1pyr1_cls_head_16hybridsequential1_conv0_fwd"
  param {
    name: "resnetv1pyr1_cls_head_16hybridsequential1_conv0_weight"
  }
  convolution_param {
    num_output: 64
    bias_term: true
    pad: 1
    kernel_size: 3
    group: 1
    stride: 1
    dilation: 1
  }
  bit_bra_w: 9
  bit_bra_y: 1  # 2
  bit_bra_bias: 1  # 2
}
layer {
  name: "resnetv1pyr1_cls_head_16relu1_fwd"
  type: "ReLU"
  bottom: "resnetv1pyr1_cls_head_16hybridsequential1_conv0_fwd"
  top: "resnetv1pyr1_cls_head_16relu1_fwd"
}
layer {
  name: "resnetv1pyr1_cls_head_16hybridsequential2_conv0_fwd"
  type: "Convolution"
  bottom: "resnetv1pyr1_cls_head_16relu1_fwd"
  top: "resnetv1pyr1_cls_head_16hybridsequential2_conv0_fwd"
  param {
    name: "resnetv1pyr1_cls_head_16hybridsequential2_conv0_weight"
  }
  convolution_param {
    num_output: 4
    bias_term: true
    pad: 0
    kernel_size: 1
    group: 1
    stride: 1
    dilation: 1
  }
  bit_bra_w: 11
  bit_bra_y: 0
  bit_bra_bias: 0
}
layer {
  name: "resnetv1pyr1_reg_head_4hybridsequential0_conv0_fwd"
  type: "Convolution"
  bottom: "resnetv1pyr1_share_head_4relu0_fwd"
  top: "resnetv1pyr1_reg_head_4hybridsequential0_conv0_fwd"
  param {
    name: "resnetv1pyr1_reg_head_4hybridsequential0_conv0_weight"
  }
  convolution_param {
    num_output: 64
    bias_term: true
    pad: 1
    kernel_size: 3
    group: 1
    stride: 1
    dilation: 1
  }
  bit_bra_w: 9
  bit_bra_y: 2
  bit_bra_bias: 2
}
layer {
  name: "resnetv1pyr1_reg_head_4relu0_fwd"
  type: "ReLU"
  bottom: "resnetv1pyr1_reg_head_4hybridsequential0_conv0_fwd"
  top: "resnetv1pyr1_reg_head_4relu0_fwd"
}
layer {
  name: "resnetv1pyr1_reg_head_4hybridsequential1_conv0_fwd"
  type: "Convolution"
  bottom: "resnetv1pyr1_reg_head_4relu0_fwd"
  top: "resnetv1pyr1_reg_head_4hybridsequential1_conv0_fwd"
  param {
    name: "resnetv1pyr1_reg_head_4hybridsequential1_conv0_weight"
  }
  convolution_param {
    num_output: 64
    bias_term: true
    pad: 1
    kernel_size: 3
    group: 1
    stride: 1
    dilation: 1
  }
  bit_bra_w: 9
  bit_bra_y: 3
  bit_bra_bias: 3
}
layer {
  name: "resnetv1pyr1_reg_head_4relu1_fwd"
  type: "ReLU"
  bottom: "resnetv1pyr1_reg_head_4hybridsequential1_conv0_fwd"
  top: "resnetv1pyr1_reg_head_4relu1_fwd"
}
layer {
  name: "resnetv1pyr1_reg_head_4hybridsequential2_conv0_fwd"
  type: "Convolution"
  bottom: "resnetv1pyr1_reg_head_4relu1_fwd"
  top: "resnetv1pyr1_reg_head_4hybridsequential2_conv0_fwd"
  param {
    name: "resnetv1pyr1_reg_head_4hybridsequential2_conv0_weight"
  }
  convolution_param {
    num_output: 28
    bias_term: true
    pad: 0
    kernel_size: 1
    group: 1
    stride: 1
    dilation: 1
  }
  bit_bra_w: 9
  bit_bra_y: 5
  bit_bra_bias: 5
}
layer {
  name: "resnetv1pyr1_reg_head_8hybridsequential0_conv0_fwd"
  type: "Convolution"
  bottom: "resnetv1pyr1_share_head_8relu0_fwd"
  top: "resnetv1pyr1_reg_head_8hybridsequential0_conv0_fwd"
  param {
    name: "resnetv1pyr1_reg_head_8hybridsequential0_conv0_weight"
  }
  convolution_param {
    num_output: 128
    bias_term: true
    pad: 1
    kernel_size: 3
    group: 1
    stride: 1
    dilation: 1
  }
  bit_bra_w: 9
  bit_bra_y: 2
  bit_bra_bias: 2
}
layer {
  name: "resnetv1pyr1_reg_head_8relu0_fwd"
  type: "ReLU"
  bottom: "resnetv1pyr1_reg_head_8hybridsequential0_conv0_fwd"
  top: "resnetv1pyr1_reg_head_8relu0_fwd"
}
layer {
  name: "resnetv1pyr1_reg_head_8hybridsequential1_conv0_fwd"
  type: "Convolution"
  bottom: "resnetv1pyr1_reg_head_8relu0_fwd"
  top: "resnetv1pyr1_reg_head_8hybridsequential1_conv0_fwd"
  param {
    name: "resnetv1pyr1_reg_head_8hybridsequential1_conv0_weight"
  }
  convolution_param {
    num_output: 128
