
name:"mxnet-mdoel"
layer {
  name: "data"
  type: "Input"
  top: "data"
  input_param {
    shape: { dim: 1 dim: 8 dim: 1088 dim: 800 }
  }
}

layer {
  name: "data2"
  type: "Input"
  top: "data2"
  input_param {
    shape: { dim: 1 dim: 1 dim: 272 dim: 200 }
  }
}

layer {
	bottom: "data"
	top: "resnetv1pyr1_hybridsequential0_conv0_fwd"
	name: "resnetv1pyr1_hybridsequential0_conv0_fwd"
	type: "Convolution"
	convolution_param {
		num_output: 32
		kernel_size: 3
		pad: 1
		group: 1
		stride: 2
		bias_term: true
		dilation: 1
	}
	param {
	  name: "data"
	}
}

layer {
  bottom: "resnetv1pyr1_hybridsequential0_conv0_fwd"
  top: "resnetv1pyr1_relu0_fwd"
  name: "resnetv1pyr1_relu0_fwd"
  type: "ReLU"
}

layer {
	bottom: "resnetv1pyr1_relu0_fwd"
	top: "resnetv1pyr1_hybridsequential1_conv0_fwd"
	name: "resnetv1pyr1_hybridsequential1_conv0_fwd"
	type: "Convolution"
	convolution_param {
		num_output: 32
		kernel_size: 3
		pad: 1
		group: 1
		stride: 1
		bias_term: true
		dilation: 1
	}
	param {
	  name: "resnetv1pyr1_hybridsequential1_conv0_weight"
	}
}

layer {
  bottom: "resnetv1pyr1_hybridsequential1_conv0_fwd"
  top: "resnetv1pyr1_relu1_fwd"
  name: "resnetv1pyr1_relu1_fwd"
  type: "ReLU"
}

layer {
	bottom: "resnetv1pyr1_relu1_fwd"
	top: "resnetv1pyr1_hybridsequential2_conv0_fwd"
	name: "resnetv1pyr1_hybridsequential2_conv0_fwd"
	type: "Convolution"
	convolution_param {
		num_output: 64
		kernel_size: 3
		pad: 1
		group: 1
		stride: 1
		bias_term: true
		dilation: 1
	}
	param {
	  name: "resnetv1pyr1_hybridsequential2_conv0_weight"
	}
}

layer {
  bottom: "resnetv1pyr1_hybridsequential2_conv0_fwd"
  top: "resnetv1pyr1_relu2_fwd"
  name: "resnetv1pyr1_relu2_fwd"
  type: "ReLU"
}

layer {
  bottom: "resnetv1pyr1_relu2_fwd"
  top: "pool0_fwd"
  name: "pool0_fwd"
  type: "Pooling"
  pooling_param {
    pool: MAX
    kernel_size: 3
    stride: 2
    pad: 1
  }
}

layer {
  bottom: "pool0_fwd"
  bottom: "data2"
  top: "resnetv1pyr1_pool0_fwd"
  name: "resnetv1pyr1_pool0_fwd"
  type: "Crop"
  crop_param {
      axis: 2
      offset: 0
      offset: 0
  }
}

layer {
	bottom: "resnetv1pyr1_pool0_fwd"
	top: "resnetv1pyr1_stage_4bottleneckv10_hybridsequential0_conv0_fwd"
	name: "resnetv1pyr1_stage_4bottleneckv10_hybridsequential0_conv0_fwd"
	type: "Convolution"
	convolution_param {
		num_output: 32
		kernel_size: 1
		pad: 0
		group: 1
		stride: 1
		bias_term: true
		dilation: 1
	}
	param {
	  name: "resnetv1pyr1_stage_4bottleneckv10_hybridsequential0_conv0_weight"
	}
}

layer {
  bottom: "resnetv1pyr1_stage_4bottleneckv10_hybridsequential0_conv0_fwd"
  top: "resnetv1pyr1_stage_4bottleneckv10_relu0_fwd"
  name: "resnetv1pyr1_stage_4bottleneckv10_relu0_fwd"
  type: "ReLU"
}

layer {
	bottom: "resnetv1pyr1_stage_4bottleneckv10_relu0_fwd"
	top: "resnetv1pyr1_stage_4bottleneckv10_hybridsequential1_conv0_fwd"
	name: "resnetv1pyr1_stage_4bottleneckv10_hybridsequential1_conv0_fwd"
	type: "Convolution"
	convolution_param {
		num_output: 32
		kernel_size: 3
		pad: 1
		group: 1
		stride: 1
		bias_term: true
		dilation: 1
	}
	param {
	  name: "resnetv1pyr1_stage_4bottleneckv10_hybridsequential1_conv0_weight"
	}
}

layer {
  bottom: "resnetv1pyr1_stage_4bottleneckv10_hybridsequential1_conv0_fwd"
  top: "resnetv1pyr1_stage_4bottleneckv10_relu1_fwd"
  name: "resnetv1pyr1_stage_4bottleneckv10_relu1_fwd"
  type: "ReLU"
}

layer {
	bottom: "resnetv1pyr1_stage_4bottleneckv10_relu1_fwd"
	top: "resnetv1pyr1_stage_4bottleneckv10_hybridsequential2_conv0_fwd"
	name: "resnetv1pyr1_stage_4bottleneckv10_hybridsequential2_conv0_fwd"
	type: "Convolution"
	convolution_param {
		num_output: 256
		kernel_size: 1
		pad: 0
		group: 1
		stride: 1
		bias_term: true
		dilation: 1
	}
	param {
	  name: "resnetv1pyr1_stage_4bottleneckv10_hybridsequential2_conv0_weight"
	}
}

layer {
	bottom: "resnetv1pyr1_pool0_fwd"
	top: "resnetv1pyr1_stage_4_shortcuthybridsequential0_conv0_fwd"
	name: "resnetv1pyr1_stage_4_shortcuthybridsequential0_conv0_fwd"
	type: "Convolution"
	convolution_param {
		num_output: 256
		kernel_size: 1
		pad: 0
		group: 1
		stride: 1
		bias_term: true
		dilation: 1
	}
	param {
	  name: "resnetv1pyr1_stage_4_shortcuthybridsequential0_conv0_weight"
	}
}

layer {
  name: "resnetv1pyr1_stage_4bottleneckv10__plus0"
  type: "Eltwise"
  bottom: "resnetv1pyr1_stage_4bottleneckv10_hybridsequential2_conv0_fwd"
  bottom: "resnetv1pyr1_stage_4_shortcuthybridsequential0_conv0_fwd"
  top: "resnetv1pyr1_stage_4bottleneckv10__plus0"
}

layer {
  bottom: "resnetv1pyr1_stage_4bottleneckv10__plus0"
  top: "resnetv1pyr1_stage_4bottleneckv10_relu2_fwd"
  name: "resnetv1pyr1_stage_4bottleneckv10_relu2_fwd"
  type: "ReLU"
}

layer {
	bottom: "resnetv1pyr1_stage_4bottleneckv10_relu2_fwd"
	top: "resnetv1pyr1_stage_4bottleneckv11_hybridsequential0_conv0_fwd"
	name: "resnetv1pyr1_stage_4bottleneckv11_hybridsequential0_conv0_fwd"
	type: "Convolution"
	convolution_param {
		num_output: 32
		kernel_size: 1
		pad: 0
		group: 1
		stride: 1
		bias_term: true
		dilation: 1
	}
	param {
	  name: "resnetv1pyr1_stage_4bottleneckv11_hybridsequential0_conv0_weight"
	}
}

layer {
  bottom: "resnetv1pyr1_stage_4bottleneckv11_hybridsequential0_conv0_fwd"
  top: "resnetv1pyr1_stage_4bottleneckv11_relu0_fwd"
  name: "resnetv1pyr1_stage_4bottleneckv11_relu0_fwd"
  type: "ReLU"
}

layer {
	bottom: "resnetv1pyr1_stage_4bottleneckv11_relu0_fwd"
	top: "resnetv1pyr1_stage_4bottleneckv11_hybridsequential1_conv0_fwd"
	name: "resnetv1pyr1_stage_4bottleneckv11_hybridsequential1_conv0_fwd"
	type: "Convolution"
	convolution_param {
		num_output: 32
		kernel_size: 3
		pad: 1
		group: 1
		stride: 1
		bias_term: true
		dilation: 1
	}
	param {
	  name: "resnetv1pyr1_stage_4bottleneckv11_hybridsequential1_conv0_weight"
	}
}

layer {
  bottom: "resnetv1pyr1_stage_4bottleneckv11_hybridsequential1_conv0_fwd"
  top: "resnetv1pyr1_stage_4bottleneckv11_relu1_fwd"
  name: "resnetv1pyr1_stage_4bottleneckv11_relu1_fwd"
  type: "ReLU"
}

layer {
	bottom: "resnetv1pyr1_stage_4bottleneckv11_relu1_fwd"
	top: "resnetv1pyr1_stage_4bottleneckv11_hybridsequential2_conv0_fwd"
	name: "resnetv1pyr1_stage_4bottleneckv11_hybridsequential2_conv0_fwd"
	type: "Convolution"
	convolution_param {
		num_output: 256
		kernel_size: 1
		pad: 0
		group: 1
		stride: 1
		bias_term: true
		dilation: 1
	}
	param {
	  name: "resnetv1pyr1_stage_4bottleneckv11_hybridsequential2_conv0_weight"
	}
}

layer {
  name: "resnetv1pyr1_stage_4bottleneckv11__plus0"
  type: "Eltwise"
  bottom: "resnetv1pyr1_stage_4bottleneckv11_hybridsequential2_conv0_fwd"
  bottom: "resnetv1pyr1_stage_4bottleneckv10_relu2_fwd"
  top: "resnetv1pyr1_stage_4bottleneckv11__plus0"
}

layer {
  bottom: "resnetv1pyr1_stage_4bottleneckv11__plus0"
  top: "resnetv1pyr1_stage_4bottleneckv11_relu2_fwd"
  name: "resnetv1pyr1_stage_4bottleneckv11_relu2_fwd"
  type: "ReLU"
}

layer {
	bottom: "resnetv1pyr1_stage_4bottleneckv11_relu2_fwd"
	top: "resnetv1pyr1_stage_4bottleneckv12_hybridsequential0_conv0_fwd"
	name: "resnetv1pyr1_stage_4bottleneckv12_hybridsequential0_conv0_fwd"
	type: "Convolution"
	convolution_param {
		num_output: 32
		kernel_size: 1
		pad: 0
		group: 1
		stride: 1
		bias_term: true
		dilation: 1
	}
	param {
	  name: "resnetv1pyr1_stage_4bottleneckv12_hybridsequential0_conv0_weight"
	}
}

layer {
  bottom: "resnetv1pyr1_stage_4bottleneckv12_hybridsequential0_conv0_fwd"
  top: "resnetv1pyr1_stage_4bottleneckv12_relu0_fwd"
  name: "resnetv1pyr1_stage_4bottleneckv12_relu0_fwd"
  type: "ReLU"
}

layer {
	bottom: "resnetv1pyr1_stage_4bottleneckv12_relu0_fwd"
	top: "resnetv1pyr1_stage_4bottleneckv12_hybridsequential1_conv0_fwd"
	name: "resnetv1pyr1_stage_4bottleneckv12_hybridsequential1_conv0_fwd"
	type: "Convolution"
	convolution_param {
		num_output: 32
		kernel_size: 3
		pad: 1
		group: 1
		stride: 1
		bias_term: true
		dilation: 1
	}
	param {
	  name: "resnetv1pyr1_stage_4bottleneckv12_hybridsequential1_conv0_weight"
	}
}

layer {
  bottom: "resnetv1pyr1_stage_4bottleneckv12_hybridsequential1_conv0_fwd"
  top: "resnetv1pyr1_stage_4bottleneckv12_relu1_fwd"
  name: "resnetv1pyr1_stage_4bottleneckv12_relu1_fwd"
  type: "ReLU"
}

layer {
	bottom: "resnetv1pyr1_stage_4bottleneckv12_relu1_fwd"
	top: "resnetv1pyr1_stage_4bottleneckv12_hybridsequential2_conv0_fwd"
	name: "resnetv1pyr1_stage_4bottleneckv12_hybridsequential2_conv0_fwd"
	type: "Convolution"
	convolution_param {
		num_output: 256
		kernel_size: 1
		pad: 0
		group: 1
		stride: 1
		bias_term: true
		dilation: 1
	}
	param {
	  name: "resnetv1pyr1_stage_4bottleneckv12_hybridsequential2_conv0_weight"
	}
}

layer {
  name: "resnetv1pyr1_stage_4bottleneckv12__plus0"
  type: "Eltwise"
  bottom: "resnetv1pyr1_stage_4bottleneckv12_hybridsequential2_conv0_fwd"
  bottom: "resnetv1pyr1_stage_4bottleneckv11_relu2_fwd"
  top: "resnetv1pyr1_stage_4bottleneckv12__plus0"
}

layer {
  bottom: "resnetv1pyr1_stage_4bottleneckv12__plus0"
  top: "resnetv1pyr1_stage_4bottleneckv12_relu2_fwd"
  name: "resnetv1pyr1_stage_4bottleneckv12_relu2_fwd"
  type: "ReLU"
}

layer {
	bottom: "resnetv1pyr1_stage_4bottleneckv12_relu2_fwd"
	top: "resnetv1pyr1_stage_8bottleneckv10_hybridsequential0_conv0_fwd"
	name: "resnetv1pyr1_stage_8bottleneckv10_hybridsequential0_conv0_fwd"
	type: "Convolution"
	convolution_param {
		num_output: 128
		kernel_size: 1
		pad: 0
		group: 1
		stride: 2
		bias_term: true
		dilation: 1
	}
	param {
	  name: "resnetv1pyr1_stage_8bottleneckv10_hybridsequential0_conv0_weight"
	}
}

layer {
  bottom: "resnetv1pyr1_stage_8bottleneckv10_hybridsequential0_conv0_fwd"
  top: "resnetv1pyr1_stage_8bottleneckv10_relu0_fwd"
  name: "resnetv1pyr1_stage_8bottleneckv10_relu0_fwd"
  type: "ReLU"
}

layer {
	bottom: "resnetv1pyr1_stage_8bottleneckv10_relu0_fwd"
	top: "resnetv1pyr1_stage_8bottleneckv10_hybridsequential1_conv0_fwd"
	name: "resnetv1pyr1_stage_8bottleneckv10_hybridsequential1_conv0_fwd"
	type: "Convolution"
	convolution_param {
		num_output: 128
		kernel_size: 3
		pad: 1
		group: 1
		stride: 1
		bias_term: true
		dilation: 1
	}
	param {
	  name: "resnetv1pyr1_stage_8bottleneckv10_hybridsequential1_conv0_weight"
	}
}

layer {
  bottom: "resnetv1pyr1_stage_8bottleneckv10_hybridsequential1_conv0_fwd"
  top: "resnetv1pyr1_stage_8bottleneckv10_relu1_fwd"
  name: "resnetv1pyr1_stage_8bottleneckv10_relu1_fwd"
  type: "ReLU"
}

layer {
	bottom: "resnetv1pyr1_stage_8bottleneckv10_relu1_fwd"
	top: "resnetv1pyr1_stage_8bottleneckv10_hybridsequential2_conv0_fwd"
	name: "resnetv1pyr1_stage_8bottleneckv10_hybridsequential2_conv0_fwd"
	type: "Convolution"
	convolution_param {
		num_output: 512
		kernel_size: 1
		pad: 0
		group: 1
		stride: 1
		bias_term: true
		dilation: 1
	}
	param {
	  name: "resnetv1pyr1_stage_8bottleneckv10_hybridsequential2_conv0_weight"
	}
}

layer {
  bottom: "resnetv1pyr1_stage_4bottleneckv12_relu2_fwd"
  top: "resnetv1pyr1_stage_8_shortcutpool0_fwd"
  name: "resnetv1pyr1_stage_8_shortcutpool0_fwd"
  type: "Pooling"
  pooling_param {
    pool: AVE
    kernel_size: 2
    stride: 2
    pad: 0
  }
}

layer {
	bottom: "resnetv1pyr1_stage_8_shortcutpool0_fwd"
	top: "resnetv1pyr1_stage_8_shortcuthybridsequential0_conv0_fwd"
	name: "resnetv1pyr1_stage_8_shortcuthybridsequential0_conv0_fwd"
	type: "Convolution"
	convolution_param {
		num_output: 512
		kernel_size: 1
		pad: 0
		group: 1
		stride: 1
		bias_term: true
		dilation: 1
	}
	param {
	  name: "resnetv1pyr1_stage_8_shortcuthybridsequential0_conv0_weight"
	}
}

layer {
  name: "resnetv1pyr1_stage_8bottleneckv10__plus0"
  type: "Eltwise"
  bottom: "resnetv1pyr1_stage_8bottleneckv10_hybridsequential2_conv0_fwd"
  bottom: "resnetv1pyr1_stage_8_shortcuthybridsequential0_conv0_fwd"
  top: "resnetv1pyr1_stage_8bottleneckv10__plus0"
}

layer {
  bottom: "resnetv1pyr1_stage_8bottleneckv10__plus0"
  top: "resnetv1pyr1_stage_8bottleneckv10_relu2_fwd"
  name: "resnetv1pyr1_stage_8bottleneckv10_relu2_fwd"
  type: "ReLU"
}

layer {
	bottom: "resnetv1pyr1_stage_8bottleneckv10_relu2_fwd"
	top: "resnetv1pyr1_stage_8bottleneckv11_hybridsequential0_conv0_fwd"
	name: "resnetv1pyr1_stage_8bottleneckv11_hybridsequential0_conv0_fwd"
	type: "Convolution"
	convolution_param {
		num_output: 64
		kernel_size: 1
		pad: 0
		group: 1
		stride: 1
		bias_term: true
		dilation: 1
	}
	param {
	  name: "resnetv1pyr1_stage_8bottleneckv11_hybridsequential0_conv0_weight"
	}
}

layer {
  bottom: "resnetv1pyr1_stage_8bottleneckv11_hybridsequential0_conv0_fwd"
  top: "resnetv1pyr1_stage_8bottleneckv11_relu0_fwd"
  name: "resnetv1pyr1_stage_8bottleneckv11_relu0_fwd"
  type: "ReLU"
}

layer {
	bottom: "resnetv1pyr1_stage_8bottleneckv11_relu0_fwd"
	top: "resnetv1pyr1_stage_8bottleneckv11_hybridsequential1_conv0_fwd"
	name: "resnetv1pyr1_stage_8bottleneckv11_hybridsequential1_conv0_fwd"
	type: "Convolution"
	convolution_param {
		num_output: 64
		kernel_size: 3
		pad: 1
		group: 1
		stride: 1
		bias_term: true
		dilation: 1
	}
	param {
	  name: "resnetv1pyr1_stage_8bottleneckv11_hybridsequential1_conv0_weight"
	}
}

layer {
  bottom: "resnetv1pyr1_stage_8bottleneckv11_hybridsequential1_conv0_fwd"
  top: "resnetv1pyr1_stage_8bottleneckv11_relu1_fwd"
  name: "resnetv1pyr1_stage_8bottleneckv11_relu1_fwd"
  type: "ReLU"
}

layer {
	bottom: "resnetv1pyr1_stage_8bottleneckv11_relu1_fwd"
	top: "resnetv1pyr1_stage_8bottleneckv11_hybridsequential2_conv0_fwd"
	name: "resnetv1pyr1_stage_8bottleneckv11_hybridsequential2_conv0_fwd"
	type: "Convolution"
	convolution_param {
		num_output: 512
		kernel_size: 1
		pad: 0
		group: 1
		stride: 1
		bias_term: true
		dilation: 1
	}
	param {
	  name: "resnetv1pyr1_stage_8bottleneckv11_hybridsequential2_conv0_weight"
	}
}

layer {
  name: "resnetv1pyr1_stage_8bottleneckv11__plus0"
  type: "Eltwise"
  bottom: "resnetv1pyr1_stage_8bottleneckv11_hybridsequential2_conv0_fwd"
  bottom: "resnetv1pyr1_stage_8bottleneckv10_relu2_fwd"
  top: "resnetv1pyr1_stage_8bottleneckv11__plus0"
}

layer {
  bottom: "resnetv1pyr1_stage_8bottleneckv11__plus0"
  top: "resnetv1pyr1_stage_8bottleneckv11_relu2_fwd"
  name: "resnetv1pyr1_stage_8bottleneckv11_relu2_fwd"
  type: "ReLU"
}

layer {
	bottom: "resnetv1pyr1_stage_8bottleneckv11_relu2_fwd"
	top: "resnetv1pyr1_stage_8bottleneckv12_hybridsequential0_conv0_fwd"
	name: "resnetv1pyr1_stage_8bottleneckv12_hybridsequential0_conv0_fwd"
	type: "Convolution"
	convolution_param {
		num_output: 64
		kernel_size: 1
		pad: 0
		group: 1
		stride: 1
		bias_term: true
		dilation: 1
	}
	param {
	  name: "resnetv1pyr1_stage_8bottleneckv12_hybridsequential0_conv0_weight"
	}
}

layer {
  bottom: "resnetv1pyr1_stage_8bottleneckv12_hybridsequential0_conv0_fwd"
  top: "resnetv1pyr1_stage_8bottleneckv12_relu0_fwd"
  name: "resnetv1pyr1_stage_8bottleneckv12_relu0_fwd"
  type: "ReLU"
}

layer {
	bottom: "resnetv1pyr1_stage_8bottleneckv12_relu0_fwd"
	top: "resnetv1pyr1_stage_8bottleneckv12_hybridsequential1_conv0_fwd"
	name: "resnetv1pyr1_stage_8bottleneckv12_hybridsequential1_conv0_fwd"
	type: "Convolution"
	convolution_param {
		num_output: 64
		kernel_size: 3
		pad: 1
		group: 1
		stride: 1
		bias_term: true
		dilation: 1
	}
	param {
	  name: "resnetv1pyr1_stage_8bottleneckv12_hybridsequential1_conv0_weight"
	}
}

layer {
  bottom: "resnetv1pyr1_stage_8bottleneckv12_hybridsequential1_conv0_fwd"
  top: "resnetv1pyr1_stage_8bottleneckv12_relu1_fwd"
  name: "resnetv1pyr1_stage_8bottleneckv12_relu1_fwd"
  type: "ReLU"
}

layer {
	bottom: "resnetv1pyr1_stage_8bottleneckv12_relu1_fwd"
	top: "resnetv1pyr1_stage_8bottleneckv12_hybridsequential2_conv0_fwd"
	name: "resnetv1pyr1_stage_8bottleneckv12_hybridsequential2_conv0_fwd"
	type: "Convolution"
	convolution_param {
		num_output: 512
		kernel_size: 1
		pad: 0
		group: 1
		stride: 1
		bias_term: true
		dilation: 1
	}
	param {
	  name: "resnetv1pyr1_stage_8bottleneckv12_hybridsequential2_conv0_weight"
	}
}

layer {
  name: "resnetv1pyr1_stage_8bottleneckv12__plus0"
  type: "Eltwise"
  bottom: "resnetv1pyr1_stage_8bottleneckv12_hybridsequential2_conv0_fwd"
  bottom: "resnetv1pyr1_stage_8bottleneckv11_relu2_fwd"
  top: "resnetv1pyr1_stage_8bottleneckv12__plus0"
}

layer {
  bottom: "resnetv1pyr1_stage_8bottleneckv12__plus0"
  top: "resnetv1pyr1_stage_8bottleneckv12_relu2_fwd"
  name: "resnetv1pyr1_stage_8bottleneckv12_relu2_fwd"
  type: "ReLU"
}

layer {
	bottom: "resnetv1pyr1_stage_8bottleneckv12_relu2_fwd"
	top: "resnetv1pyr1_stage_8bottleneckv13_hybridsequential0_conv0_fwd"
	name: "resnetv1pyr1_stage_8bottleneckv13_hybridsequential0_conv0_fwd"
	type: "Convolution"
	convolution_param {
		num_output: 64
		kernel_size: 1
		pad: 0
		group: 1
		stride: 1
		bias_term: true
		dilation: 1
	}
	param {
	  name: "resnetv1pyr1_stage_8bottleneckv13_hybridsequential0_conv0_weight"
	}
}

layer {
  bottom: "resnetv1pyr1_stage_8bottleneckv13_hybridsequential0_conv0_fwd"
  top: "resnetv1pyr1_stage_8bottleneckv13_relu0_fwd"
  name: "resnetv1pyr1_stage_8bottleneckv13_relu0_fwd"
  type: "ReLU"
}

layer {
	bottom: "resnetv1pyr1_stage_8bottleneckv13_relu0_fwd"
	top: "resnetv1pyr1_stage_8bottleneckv13_hybridsequential1_conv0_fwd"
	name: "resnetv1pyr1_stage_8bottleneckv13_hybridsequential1_conv0_fwd"
	type: "Convolution"
	convolution_param {
		num_output: 64
		kernel_size: 3
		pad: 1
		group: 1
		stride: 1
		bias_term: true
		dilation: 1
	}
	param {
	  name: "resnetv1pyr1_stage_8bottleneckv13_hybridsequential1_conv0_weight"
	}
}

layer {
  bottom: "resnetv1pyr1_stage_8bottleneckv13_hybridsequential1_conv0_fwd"
  top: "resnetv1pyr1_stage_8bottleneckv13_relu1_fwd"
  name: "resnetv1pyr1_stage_8bottleneckv13_relu1_fwd"
  type: "ReLU"
}

layer {
	bottom: "resnetv1pyr1_stage_8bottleneckv13_relu1_fwd"
	top: "resnetv1pyr1_stage_8bottleneckv13_hybridsequential2_conv0_fwd"
	name: "resnetv1pyr1_stage_8bottleneckv13_hybridsequential2_conv0_fwd"
	type: "Convolution"
	convolution_param {
		num_output: 512
		kernel_size: 1
		pad: 0
		group: 1
		stride: 1
		bias_term: true
		dilation: 1
	}
	param {
	  name: "resnetv1pyr1_stage_8bottleneckv13_hybridsequential2_conv0_weight"
	}
}

layer {
  name: "resnetv1pyr1_stage_8bottleneckv13__plus0"
  type: "Eltwise"
  bottom: "resnetv1pyr1_stage_8bottleneckv13_hybridsequential2_conv0_fwd"
  bottom: "resnetv1pyr1_stage_8bottleneckv12_relu2_fwd"
  top: "resnetv1pyr1_stage_8bottleneckv13__plus0"
}

layer {
  bottom: "resnetv1pyr1_stage_8bottleneckv13__plus0"
  top: "resnetv1pyr1_stage_8bottleneckv13_relu2_fwd"
  name: "resnetv1pyr1_stage_8bottleneckv13_relu2_fwd"
  type: "ReLU"
}

layer {
	bottom: "resnetv1pyr1_stage_8bottleneckv13_relu2_fwd"
	top: "resnetv1pyr1_hybridsequential6_conv0_fwd"
	name: "resnetv1pyr1_hybridsequential6_conv0_fwd"
	type: "Convolution"
	convolution_param {
		num_output: 128
		kernel_size: 1
		pad: 0
		group: 1
		stride: 1
		bias_term: true
		dilation: 1
	}
	param {
	  name: "resnetv1pyr1_hybridsequential6_conv0_weight"
	}
}

layer {
	bottom: "resnetv1pyr1_stage_8bottleneckv13_relu2_fwd"
	top: "resnetv1pyr1_stage_16bottleneckv10_hybridsequential0_conv0_fwd"
	name: "resnetv1pyr1_stage_16bottleneckv10_hybridsequential0_conv0_fwd"
	type: "Convolution"
	convolution_param {
		num_output: 256
		kernel_size: 1
		pad: 0
		group: 1
		stride: 2
		bias_term: true
		dilation: 1
	}
	param {
	  name: "resnetv1pyr1_stage_16bottleneckv10_hybridsequential0_conv0_weight"
	}
}

layer {
  bottom: "resnetv1pyr1_stage_16bottleneckv10_hybridsequential0_conv0_fwd"
  top: "resnetv1pyr1_stage_16bottleneckv10_relu0_fwd"
  name: "resnetv1pyr1_stage_16bottleneckv10_relu0_fwd"
  type: "ReLU"
}

layer {
	bottom: "resnetv1pyr1_stage_16bottleneckv10_relu0_fwd"
	top: "resnetv1pyr1_stage_16bottleneckv10_hybridsequential1_conv0_fwd"
	name: "resnetv1pyr1_stage_16bottleneckv10_hybridsequential1_conv0_fwd"
	type: "Convolution"
	convolution_param {
		num_output: 256
		kernel_size: 3
		pad: 1
		group: 1
		stride: 1
		bias_term: true
		dilation: 1
	}
	param {
	  name: "resnetv1pyr1_stage_16bottleneckv10_hybridsequential1_conv0_weight"
	}
}

layer {
  bottom: "resnetv1pyr1_stage_16bottleneckv10_hybridsequential1_conv0_fwd"
  top: "resnetv1pyr1_stage_16bottleneckv10_relu1_fwd"
  name: "resnetv1pyr1_stage_16bottleneckv10_relu1_fwd"
  type: "ReLU"
}

layer {
	bottom: "resnetv1pyr1_stage_16bottleneckv10_relu1_fwd"
	top: "resnetv1pyr1_stage_16bottleneckv10_hybridsequential2_conv0_fwd"
	name: "resnetv1pyr1_stage_16bottleneckv10_hybridsequential2_conv0_fwd"
	type: "Convolution"
	convolution_param {
		num_output: 1024
		kernel_size: 1
		pad: 0
		group: 1
		stride: 1
		bias_term: true
		dilation: 1
	}
	param {
	  name: "resnetv1pyr1_stage_16bottleneckv10_hybridsequential2_conv0_weight"
	}
}

layer {
  bottom: "resnetv1pyr1_stage_8bottleneckv13_relu2_fwd"
  top: "resnetv1pyr1_stage_16_shortcutpool0_fwd"
  name: "resnetv1pyr1_stage_16_shortcutpool0_fwd"
  type: "Pooling"
  pooling_param {
    pool: AVE
    kernel_size: 2
    stride: 2
    pad: 0
  }
}

layer {
	bottom: "resnetv1pyr1_stage_16_shortcutpool0_fwd"
	top: "resnetv1pyr1_stage_16_shortcuthybridsequential0_conv0_fwd"
	name: "resnetv1pyr1_stage_16_shortcuthybridsequential0_conv0_fwd"
	type: "Convolution"
	convolution_param {
		num_output: 1024
		kernel_size: 1
		pad: 0
		group: 1
		stride: 1
		bias_term: true
		dilation: 1
	}
	param {
	  name: "resnetv1pyr1_stage_16_shortcuthybridsequential0_conv0_weight"
	}
}

layer {
  name: "resnetv1pyr1_stage_16bottleneckv10__plus0"
  type: "Eltwise"
  bottom: "resnetv1pyr1_stage_16bottleneckv10_hybridsequential2_conv0_fwd"
  bottom: "resnetv1pyr1_stage_16_shortcuthybridsequential0_conv0_fwd"
  top: "resnetv1pyr1_stage_16bottleneckv10__plus0"
}

layer {
  bottom: "resnetv1pyr1_stage_16bottleneckv10__plus0"
  top: "resnetv1pyr1_stage_16bottleneckv10_relu2_fwd"
  name: "resnetv1pyr1_stage_16bottleneckv10_relu2_fwd"
  type: "ReLU"
}

layer {
	bottom: "resnetv1pyr1_stage_16bottleneckv10_relu2_fwd"
	top: "resnetv1pyr1_stage_16bottleneckv11_hybridsequential0_conv0_fwd"
	name: "resnetv1pyr1_stage_16bottleneckv11_hybridsequential0_conv0_fwd"
	type: "Convolution"
	convolution_param {
		num_output: 128
		kernel_size: 1
		pad: 0
		group: 1
		stride: 1
		bias_term: true
		dilation: 1
	}
	param {
	  name: "resnetv1pyr1_stage_16bottleneckv11_hybridsequential0_conv0_weight"
	}
}

layer {
  bottom: "resnetv1pyr1_stage_16bottleneckv11_hybridsequential0_conv0_fwd"
  top: "resnetv1pyr1_stage_16bottleneckv11_relu0_fwd"
  name: "resnetv1pyr1_stage_16bottleneckv11_relu0_fwd"
  type: "ReLU"
}

layer {
	bottom: "resnetv1pyr1_stage_16bottleneckv11_relu0_fwd"
	top: "resnetv1pyr1_stage_16bottleneckv11_hybridsequential1_conv0_fwd"
	name: "resnetv1pyr1_stage_16bottleneckv11_hybridsequential1_conv0_fwd"
	type: "Convolution"
	convolution_param {
		num_output: 128
		kernel_size: 3
		pad: 1
		group: 1
		stride: 1
		bias_term: true
		dilation: 1
	}
	param {
	  name: "resnetv1pyr1_stage_16bottleneckv11_hybridsequential1_conv0_weight"
	}
}

layer {
  bottom: "resnetv1pyr1_stage_16bottleneckv11_hybridsequential1_conv0_fwd"
  top: "resnetv1pyr1_stage_16bottleneckv11_relu1_fwd"
  name: "resnetv1pyr1_stage_16bottleneckv11_relu1_fwd"
  type: "ReLU"
}

layer {
	bottom: "resnetv1pyr1_stage_16bottleneckv11_relu1_fwd"
	top: "resnetv1pyr1_stage_16bottleneckv11_hybridsequential2_conv0_fwd"
	name: "resnetv1pyr1_stage_16bottleneckv11_hybridsequential2_conv0_fwd"
	type: "Convolution"
	convolution_param {
		num_output: 1024
		kernel_size: 1
		pad: 0
		group: 1
		stride: 1
		bias_term: true
		dilation: 1
	}
	param {
	  name: "resnetv1pyr1_stage_16bottleneckv11_hybridsequential2_conv0_weight"
	}
}

layer {
  name: "resnetv1pyr1_stage_16bottleneckv11__plus0"
  type: "Eltwise"
  bottom: "resnetv1pyr1_stage_16bottleneckv11_hybridsequential2_conv0_fwd"
  bottom: "resnetv1pyr1_stage_16bottleneckv10_relu2_fwd"
  top: "resnetv1pyr1_stage_16bottleneckv11__plus0"
}

layer {
  bottom: "resnetv1pyr1_stage_16bottleneckv11__plus0"
  top: "resnetv1pyr1_stage_16bottleneckv11_relu2_fwd"
  name: "resnetv1pyr1_stage_16bottleneckv11_relu2_fwd"
  type: "ReLU"
}

layer {
	bottom: "resnetv1pyr1_stage_16bottleneckv11_relu2_fwd"
	top: "resnetv1pyr1_stage_16bottleneckv12_hybridsequential0_conv0_fwd"
	name: "resnetv1pyr1_stage_16bottleneckv12_hybridsequential0_conv0_fwd"
	type: "Convolution"
	convolution_param {
		num_output: 128
		kernel_size: 1
		pad: 0
		group: 1
		stride: 1
		bias_term: true
		dilation: 1
	}
	param {
	  name: "resnetv1pyr1_stage_16bottleneckv12_hybridsequential0_conv0_weight"
	}
}

layer {
  bottom: "resnetv1pyr1_stage_16bottleneckv12_hybridsequential0_conv0_fwd"
  top: "resnetv1pyr1_stage_16bottleneckv12_relu0_fwd"
  name: "resnetv1pyr1_stage_16bottleneckv12_relu0_fwd"
  type: "ReLU"
}

layer {
	bottom: "resnetv1pyr1_stage_16bottleneckv12_relu0_fwd"
	top: "resnetv1pyr1_stage_16bottleneckv12_hybridsequential1_conv0_fwd"
	name: "resnetv1pyr1_stage_16bottleneckv12_hybridsequential1_conv0_fwd"
	type: "Convolution"
	convolution_param {
		num_output: 128
		kernel_size: 3
		pad: 1
		group: 1
		stride: 1
		bias_term: true
		dilation: 1
	}
	param {
	  name: "resnetv1pyr1_stage_16bottleneckv12_hybridsequential1_conv0_weight"
	}
}

layer {
  bottom: "resnetv1pyr1_stage_16bottleneckv12_hybridsequential1_conv0_fwd"
  top: "resnetv1pyr1_stage_16bottleneckv12_relu1_fwd"
  name: "resnetv1pyr1_stage_16bottleneckv12_relu1_fwd"
  type: "ReLU"
}

layer {
	bottom: "resnetv1pyr1_stage_16bottleneckv12_relu1_fwd"
	top: "resnetv1pyr1_stage_16bottleneckv12_hybridsequential2_conv0_fwd"
	name: "resnetv1pyr1_stage_16bottleneckv12_hybridsequential2_conv0_fwd"
	type: "Convolution"
	convolution_param {
		num_output: 1024
		kernel_size: 1
		pad: 0
		group: 1
		stride: 1
		bias_term: true
		dilation: 1
	}
	param {
	  name: "resnetv1pyr1_stage_16bottleneckv12_hybridsequential2_conv0_weight"
	}
}

layer {
  name: "resnetv1pyr1_stage_16bottleneckv12__plus0"
  type: "Eltwise"
  bottom: "resnetv1pyr1_stage_16bottleneckv12_hybridsequential2_conv0_fwd"
  bottom: "resnetv1pyr1_stage_16bottleneckv11_relu2_fwd"
  top: "resnetv1pyr1_stage_16bottleneckv12__plus0"
}

layer {
  bottom: "resnetv1pyr1_stage_16bottleneckv12__plus0"
  top: "resnetv1pyr1_stage_16bottleneckv12_relu2_fwd"
  name: "resnetv1pyr1_stage_16bottleneckv12_relu2_fwd"
  type: "ReLU"
}

layer {
	bottom: "resnetv1pyr1_stage_16bottleneckv12_relu2_fwd"
	top: "resnetv1pyr1_hybridsequential4_conv0_fwd"
	name: "resnetv1pyr1_hybridsequential4_conv0_fwd"
	type: "Convolution"
	convolution_param {
		num_output: 256
		kernel_size: 1
		pad: 0
		group: 1
		stride: 1
		bias_term: true
		dilation: 1
	}
	param {
	  name: "resnetv1pyr1_hybridsequential4_conv0_weight"
	}
}

layer {
	bottom: "resnetv1pyr1_stage_16bottleneckv12_relu2_fwd"
	top: "resnetv1pyr1_stage_16_dbottleneckv10_hybridsequential0_conv0_fwd"
	name: "resnetv1pyr1_stage_16_dbottleneckv10_hybridsequential0_conv0_fwd"
	type: "Convolution"
	convolution_param {
		num_output: 128
		kernel_size: 1
		pad: 0
		group: 1
		stride: 1
		bias_term: true
		dilation: 1
	}
	param {
	  name: "resnetv1pyr1_stage_16_dbottleneckv10_hybridsequential0_conv0_weight"
	}
}

layer {
  bottom: "resnetv1pyr1_stage_16_dbottleneckv10_hybridsequential0_conv0_fwd"
  top: "resnetv1pyr1_stage_16_dbottleneckv10_relu0_fwd"
  name: "resnetv1pyr1_stage_16_dbottleneckv10_relu0_fwd"
  type: "ReLU"
}

layer {
	bottom: "resnetv1pyr1_stage_16_dbottleneckv10_relu0_fwd"
	top: "resnetv1pyr1_stage_16_dbottleneckv10_hybridsequential1_conv0_fwd"
	name: "resnetv1pyr1_stage_16_dbottleneckv10_hybridsequential1_conv0_fwd"
	type: "Convolution"
	convolution_param {
		num_output: 128
		kernel_size: 3
		pad: 2
		group: 1
		stride: 1
		bias_term: true
		dilation: 2
	}
	param {
	  name: "resnetv1pyr1_stage_16_dbottleneckv10_hybridsequential1_conv0_weight"
	}
}

layer {
  bottom: "resnetv1pyr1_stage_16_dbottleneckv10_hybridsequential1_conv0_fwd"
  top: "resnetv1pyr1_stage_16_dbottleneckv10_relu1_fwd"
  name: "resnetv1pyr1_stage_16_dbottleneckv10_relu1_fwd"
  type: "ReLU"
}

layer {
	bottom: "resnetv1pyr1_stage_16_dbottleneckv10_relu1_fwd"
	top: "resnetv1pyr1_stage_16_dbottleneckv10_hybridsequential2_conv0_fwd"
	name: "resnetv1pyr1_stage_16_dbottleneckv10_hybridsequential2_conv0_fwd"
	type: "Convolution"
	convolution_param {
		num_output: 1024
		kernel_size: 1
		pad: 0
		group: 1
		stride: 1
		bias_term: true
		dilation: 1
	}
	param {
	  name: "resnetv1pyr1_stage_16_dbottleneckv10_hybridsequential2_conv0_weight"
	}
}

layer {
	bottom: "resnetv1pyr1_stage_16bottleneckv12_relu2_fwd"
	top: "resnetv1pyr1_stage_16_d_shortcuthybridsequential0_conv0_fwd"
	name: "resnetv1pyr1_stage_16_d_shortcuthybridsequential0_conv0_fwd"
	type: "Convolution"
	convolution_param {
		num_output: 1024
		kernel_size: 1
		pad: 0
		group: 1
		stride: 1
		bias_term: true
		dilation: 1
	}
	param {
	  name: "resnetv1pyr1_stage_16_d_shortcuthybridsequential0_conv0_weight"
	}
}

layer {
  name: "resnetv1pyr1_stage_16_dbottleneckv10__plus0"
  type: "Eltwise"
  bottom: "resnetv1pyr1_stage_16_dbottleneckv10_hybridsequential2_conv0_fwd"
  bottom: "resnetv1pyr1_stage_16_d_shortcuthybridsequential0_conv0_fwd"
  top: "resnetv1pyr1_stage_16_dbottleneckv10__plus0"
}

layer {
  bottom: "resnetv1pyr1_stage_16_dbottleneckv10__plus0"
  top: "resnetv1pyr1_stage_16_dbottleneckv10_relu2_fwd"
  name: "resnetv1pyr1_stage_16_dbottleneckv10_relu2_fwd"
  type: "ReLU"
}

layer {
	bottom: "resnetv1pyr1_stage_16_dbottleneckv10_relu2_fwd"
	top: "resnetv1pyr1_stage_16_dbottleneckv11_hybridsequential0_conv0_fwd"
	name: "resnetv1pyr1_stage_16_dbottleneckv11_hybridsequential0_conv0_fwd"
	type: "Convolution"
	convolution_param {
		num_output: 128
		kernel_size: 1
		pad: 0
		group: 1
		stride: 1
		bias_term: true
		dilation: 1
	}
	param {
	  name: "resnetv1pyr1_stage_16_dbottleneckv11_hybridsequential0_conv0_weight"
	}
}

layer {
  bottom: "resnetv1pyr1_stage_16_dbottleneckv11_hybridsequential0_conv0_fwd"
  top: "resnetv1pyr1_stage_16_dbottleneckv11_relu0_fwd"
  name: "resnetv1pyr1_stage_16_dbottleneckv11_relu0_fwd"
  type: "ReLU"
}

layer {
	bottom: "resnetv1pyr1_stage_16_dbottleneckv11_relu0_fwd"
	top: "resnetv1pyr1_stage_16_dbottleneckv11_hybridsequential1_conv0_fwd"
	name: "resnetv1pyr1_stage_16_dbottleneckv11_hybridsequential1_conv0_fwd"
	type: "Convolution"
	convolution_param {
		num_output: 128
		kernel_size: 3
		pad: 2
		group: 1
		stride: 1
		bias_term: true
		dilation: 2
	}
	param {
	  name: "resnetv1pyr1_stage_16_dbottleneckv11_hybridsequential1_conv0_weight"
	}
}

layer {
  bottom: "resnetv1pyr1_stage_16_dbottleneckv11_hybridsequential1_conv0_fwd"
  top: "resnetv1pyr1_stage_16_dbottleneckv11_relu1_fwd"
  name: "resnetv1pyr1_stage_16_dbottleneckv11_relu1_fwd"
  type: "ReLU"
}

layer {
	bottom: "resnetv1pyr1_stage_16_dbottleneckv11_relu1_fwd"
	top: "resnetv1pyr1_stage_16_dbottleneckv11_hybridsequential2_conv0_fwd"
	name: "resnetv1pyr1_stage_16_dbottleneckv11_hybridsequential2_conv0_fwd"
	type: "Convolution"
	convolution_param {
		num_output: 1024
		kernel_size: 1
		pad: 0
		group: 1
		stride: 1
		bias_term: true
		dilation: 1
	}
	param {
	  name: "resnetv1pyr1_stage_16_dbottleneckv11_hybridsequential2_conv0_weight"
	}
}

layer {
  name: "resnetv1pyr1_stage_16_dbottleneckv11__plus0"
  type: "Eltwise"
  bottom: "resnetv1pyr1_stage_16_dbottleneckv11_hybridsequential2_conv0_fwd"
  bottom: "resnetv1pyr1_stage_16_dbottleneckv10_relu2_fwd"
  top: "resnetv1pyr1_stage_16_dbottleneckv11__plus0"
}

layer {
  bottom: "resnetv1pyr1_stage_16_dbottleneckv11__plus0"
  top: "resnetv1pyr1_stage_16_dbottleneckv11_relu2_fwd"
  name: "resnetv1pyr1_stage_16_dbottleneckv11_relu2_fwd"
  type: "ReLU"
}

layer {
	bottom: "resnetv1pyr1_stage_16_dbottleneckv11_relu2_fwd"
	top: "resnetv1pyr1_stage_16_dbottleneckv12_hybridsequential0_conv0_fwd"
	name: "resnetv1pyr1_stage_16_dbottleneckv12_hybridsequential0_conv0_fwd"
	type: "Convolution"
	convolution_param {
		num_output: 128
		kernel_size: 1
		pad: 0
		group: 1
		stride: 1
		bias_term: true
		dilation: 1
	}
	param {
	  name: "resnetv1pyr1_stage_16_dbottleneckv12_hybridsequential0_conv0_weight"
	}
}

layer {
  bottom: "resnetv1pyr1_stage_16_dbottleneckv12_hybridsequential0_conv0_fwd"
  top: "resnetv1pyr1_stage_16_dbottleneckv12_relu0_fwd"
  name: "resnetv1pyr1_stage_16_dbottleneckv12_relu0_fwd"
  type: "ReLU"
}

layer {
	bottom: "resnetv1pyr1_stage_16_dbottleneckv12_relu0_fwd"
	top: "resnetv1pyr1_stage_16_dbottleneckv12_hybridsequential1_conv0_fwd"
	name: "resnetv1pyr1_stage_16_dbottleneckv12_hybridsequential1_conv0_fwd"
	type: "Convolution"
	convolution_param {
		num_output: 128
		kernel_size: 3
		pad: 2
		group: 1
		stride: 1
		bias_term: true
		dilation: 2
	}
	param {
	  name: "resnetv1pyr1_stage_16_dbottleneckv12_hybridsequential1_conv0_weight"
	}
}

layer {
  bottom: "resnetv1pyr1_stage_16_dbottleneckv12_hybridsequential1_conv0_fwd"
  top: "resnetv1pyr1_stage_16_dbottleneckv12_relu1_fwd"
  name: "resnetv1pyr1_stage_16_dbottleneckv12_relu1_fwd"
  type: "ReLU"
}

layer {
	bottom: "resnetv1pyr1_stage_16_dbottleneckv12_relu1_fwd"
	top: "resnetv1pyr1_stage_16_dbottleneckv12_hybridsequential2_conv0_fwd"
	name: "resnetv1pyr1_stage_16_dbottleneckv12_hybridsequential2_conv0_fwd"
	type: "Convolution"
	convolution_param {
		num_output: 1024
		kernel_size: 1
		pad: 0
		group: 1
		stride: 1
		bias_term: true
		dilation: 1
	}
	param {
	  name: "resnetv1pyr1_stage_16_dbottleneckv12_hybridsequential2_conv0_weight"
	}
}

layer {
  name: "resnetv1pyr1_stage_16_dbottleneckv12__plus0"
  type: "Eltwise"
  bottom: "resnetv1pyr1_stage_16_dbottleneckv12_hybridsequential2_conv0_fwd"
  bottom: "resnetv1pyr1_stage_16_dbottleneckv11_relu2_fwd"
  top: "resnetv1pyr1_stage_16_dbottleneckv12__plus0"
}

layer {
  bottom: "resnetv1pyr1_stage_16_dbottleneckv12__plus0"
  top: "resnetv1pyr1_stage_16_dbottleneckv12_relu2_fwd"
  name: "resnetv1pyr1_stage_16_dbottleneckv12_relu2_fwd"
  type: "ReLU"
}

layer {
	bottom: "resnetv1pyr1_stage_16_dbottleneckv12_relu2_fwd"
	top: "resnetv1pyr1_hybridsequential3_conv0_fwd"
	name: "resnetv1pyr1_hybridsequential3_conv0_fwd"
	type: "Convolution"
	convolution_param {
		num_output: 256
		kernel_size: 1
		pad: 0
		group: 1
		stride: 1
		bias_term: true
		dilation: 1
	}
	param {
	  name: "resnetv1pyr1_hybridsequential3_conv0_weight"
	}
}

layer {
  name: "resnetv1pyr1__plus0"
  type: "Eltwise"
  bottom: "resnetv1pyr1_hybridsequential4_conv0_fwd"
  bottom: "resnetv1pyr1_hybridsequential3_conv0_fwd"
  top: "resnetv1pyr1__plus0"
}

layer {
	bottom: "resnetv1pyr1__plus0"
	top: "resnetv1pyr1_hybridsequential5_conv0_fwd"
	name: "resnetv1pyr1_hybridsequential5_conv0_fwd"
	type: "Convolution"
	convolution_param {
		num_output: 128
		kernel_size: 3
		pad: 1
		group: 1
		stride: 1
		bias_term: true
		dilation: 1
	}
	param {
	  name: "resnetv1pyr1_hybridsequential5_conv0_weight"
	}
}

layer {
	bottom: "resnetv1pyr1_hybridsequential5_conv0_fwd"
	top: "resnetv1pyr1_upsampling0"
	name: "resnetv1pyr1_upsampling0"
	type: "Deconvolution"
	convolution_param {
		num_output: 128
		kernel_size: 2
		pad: 0
		stride: 2
      weight_filler {
        type: "constant"
        value: 0
	    }
	}
}

layer {
  name: "resnetv1pyr1__plus1"
  type: "Eltwise"
  bottom: "resnetv1pyr1_hybridsequential6_conv0_fwd"
  bottom: "resnetv1pyr1_upsampling0"
  top: "resnetv1pyr1__plus1"
}

layer {
	bottom: "resnetv1pyr1__plus1"
	top: "resnetv1pyr1_hybridsequential7_conv0_fwd"
	name: "resnetv1pyr1_hybridsequential7_conv0_fwd"
	type: "Convolution"
	convolution_param {
		num_output: 64
		kernel_size: 3
		pad: 1
		group: 1
		stride: 1
		bias_term: true
		dilation: 1
	}
	param {
	  name: "resnetv1pyr1_hybridsequential7_conv0_weight"
	}
}

layer {
	bottom: "resnetv1pyr1_hybridsequential7_conv0_fwd"
	top: "resnetv1pyr1_upsampling1"
	name: "resnetv1pyr1_upsampling1"
	type: "Deconvolution"
	convolution_param {
		num_output: 64
		kernel_size: 2
		pad: 0
		stride: 2
      weight_filler {
        type: "constant"
        value: 0
	    }
	}
}

layer {
	bottom: "resnetv1pyr1_stage_4bottleneckv12_relu2_fwd"
	top: "resnetv1pyr1_hybridsequential8_conv0_fwd"
	name: "resnetv1pyr1_hybridsequential8_conv0_fwd"
	type: "Convolution"
	convolution_param {
		num_output: 64
		kernel_size: 1
		pad: 0
		group: 1
		stride: 1
		bias_term: true
		dilation: 1
	}
	param {
	  name: "resnetv1pyr1_hybridsequential8_conv0_weight"
	}
}

layer {
  name: "resnetv1pyr1__plus2"
  type: "Eltwise"
  bottom: "resnetv1pyr1_upsampling1"
  bottom: "resnetv1pyr1_hybridsequential8_conv0_fwd"
  top: "resnetv1pyr1__plus2"
}

layer {
	bottom: "resnetv1pyr1__plus2"
	top: "resnetv1pyr1_hybridsequential9_conv0_fwd"
	name: "resnetv1pyr1_hybridsequential9_conv0_fwd"
	type: "Convolution"
	convolution_param {
		num_output: 64
		kernel_size: 3
		pad: 1
		group: 1
		stride: 1
		bias_term: true
		dilation: 1
	}
	param {
	  name: "resnetv1pyr1_hybridsequential9_conv0_weight"
	}
}

layer {
	bottom: "resnetv1pyr1_hybridsequential9_conv0_fwd"
	top: "resnetv1pyr1_share_head_4hybridsequential0_conv0_fwd"
	name: "resnetv1pyr1_share_head_4hybridsequential0_conv0_fwd"
	type: "Convolution"
	convolution_param {
		num_output: 64
		kernel_size: 3
		pad: 1
		group: 1
		stride: 1
		bias_term: true
		dilation: 1
	}
	param {
	  name: "resnetv1pyr1_share_head_4hybridsequential0_conv0_weight"
	}
}

layer {
  bottom: "resnetv1pyr1_share_head_4hybridsequential0_conv0_fwd"
  top: "resnetv1pyr1_share_head_4relu0_fwd"
  name: "resnetv1pyr1_share_head_4relu0_fwd"
  type: "ReLU"
}

layer {
	bottom: "resnetv1pyr1_share_head_4relu0_fwd"
	top: "resnetv1pyr1_cls_head_4hybridsequential0_conv0_fwd"
	name: "resnetv1pyr1_cls_head_4hybridsequential0_conv0_fwd"
	type: "Convolution"
	convolution_param {
		num_output: 64
		kernel_size: 3
		pad: 1
		group: 1
		stride: 1
		bias_term: true
		dilation: 1
	}
	param {
	  name: "resnetv1pyr1_cls_head_4hybridsequential0_conv0_weight"
	}
}

layer {
  bottom: "resnetv1pyr1_cls_head_4hybridsequential0_conv0_fwd"
  top: "resnetv1pyr1_cls_head_4relu0_fwd"
  name: "resnetv1pyr1_cls_head_4relu0_fwd"
  type: "ReLU"
}

layer {
	bottom: "resnetv1pyr1_cls_head_4relu0_fwd"
	top: "resnetv1pyr1_cls_head_4hybridsequential1_conv0_fwd"
	name: "resnetv1pyr1_cls_head_4hybridsequential1_conv0_fwd"
	type: "Convolution"
	convolution_param {
		num_output: 64
		kernel_size: 3
		pad: 1
		group: 1
		stride: 1
		bias_term: true
		dilation: 1
	}
	param {
	  name: "resnetv1pyr1_cls_head_4hybridsequential1_conv0_weight"
	}
}

layer {
  bottom: "resnetv1pyr1_cls_head_4hybridsequential1_conv0_fwd"
  top: "resnetv1pyr1_cls_head_4relu1_fwd"
  name: "resnetv1pyr1_cls_head_4relu1_fwd"
  type: "ReLU"
}

layer {
	bottom: "resnetv1pyr1_cls_head_4relu1_fwd"
	top: "resnetv1pyr1_cls_head_4hybridsequential2_conv0_fwd"
	name: "resnetv1pyr1_cls_head_4hybridsequential2_conv0_fwd"
	type: "Convolution"
	convolution_param {
		num_output: 4
		kernel_size: 1
		pad: 0
		group: 1
		stride: 1
		bias_term: true
		dilation: 1
	}
	param {
	  name: "resnetv1pyr1_cls_head_4hybridsequential2_conv0_weight"
	}
}



layer {
	bottom: "resnetv1pyr1_hybridsequential7_conv0_fwd"
	top: "resnetv1pyr1_share_head_8hybridsequential0_conv0_fwd"
	name: "resnetv1pyr1_share_head_8hybridsequential0_conv0_fwd"
	type: "Convolution"
	convolution_param {
		num_output: 128
		kernel_size: 3
		pad: 1
		group: 1
		stride: 1
		bias_term: true
		dilation: 1
	}
	param {
	  name: "resnetv1pyr1_share_head_8hybridsequential0_conv0_weight"
	}
}

layer {
  bottom: "resnetv1pyr1_share_head_8hybridsequential0_conv0_fwd"
  top: "resnetv1pyr1_share_head_8relu0_fwd"
  name: "resnetv1pyr1_share_head_8relu0_fwd"
  type: "ReLU"
}

layer {
	bottom: "resnetv1pyr1_share_head_8relu0_fwd"
	top: "resnetv1pyr1_cls_head_8hybridsequential0_conv0_fwd"
	name: "resnetv1pyr1_cls_head_8hybridsequential0_conv0_fwd"
	type: "Convolution"
	convolution_param {
		num_output: 128
		kernel_size: 3
		pad: 1
		group: 1
		stride: 1
		bias_term: true
		dilation: 1
	}
	param {
	  name: "resnetv1pyr1_cls_head_8hybridsequential0_conv0_weight"
	}
}

layer {
  bottom: "resnetv1pyr1_cls_head_8hybridsequential0_conv0_fwd"
  top: "resnetv1pyr1_cls_head_8relu0_fwd"
  name: "resnetv1pyr1_cls_head_8relu0_fwd"
  type: "ReLU"
}

layer {
	bottom: "resnetv1pyr1_cls_head_8relu0_fwd"
	top: "resnetv1pyr1_cls_head_8hybridsequential1_conv0_fwd"
	name: "resnetv1pyr1_cls_head_8hybridsequential1_conv0_fwd"
	type: "Convolution"
	convolution_param {
		num_output: 64
		kernel_size: 3
		pad: 1
		group: 1
		stride: 1
		bias_term: true
		dilation: 1
	}
	param {
	  name: "resnetv1pyr1_cls_head_8hybridsequential1_conv0_weight"
	}
}

layer {
  bottom: "resnetv1pyr1_cls_head_8hybridsequential1_conv0_fwd"
  top: "resnetv1pyr1_cls_head_8relu1_fwd"
  name: "resnetv1pyr1_cls_head_8relu1_fwd"
  type: "ReLU"
}

layer {
	bottom: "resnetv1pyr1_cls_head_8relu1_fwd"
	top: "resnetv1pyr1_cls_head_8hybridsequential2_conv0_fwd"
	name: "resnetv1pyr1_cls_head_8hybridsequential2_conv0_fwd"
	type: "Convolution"
	convolution_param {
		num_output: 4
		kernel_size: 1
		pad: 0
		group: 1
		stride: 1
		bias_term: true
		dilation: 1
	}
	param {
	  name: "resnetv1pyr1_cls_head_8hybridsequential2_conv0_weight"
	}
}



layer {
	bottom: "resnetv1pyr1_hybridsequential5_conv0_fwd"
	top: "resnetv1pyr1_share_head_16hybridsequential0_conv0_fwd"
	name: "resnetv1pyr1_share_head_16hybridsequential0_conv0_fwd"
	type: "Convolution"
	convolution_param {
		num_output: 256
		kernel_size: 3
		pad: 1
		group: 1
		stride: 1
		bias_term: true
		dilation: 1
	}
	param {
	  name: "resnetv1pyr1_share_head_16hybridsequential0_conv0_weight"
	}
}

layer {
  bottom: "resnetv1pyr1_share_head_16hybridsequential0_conv0_fwd"
  top: "resnetv1pyr1_share_head_16relu0_fwd"
  name: "resnetv1pyr1_share_head_16relu0_fwd"
  type: "ReLU"
}

layer {
	bottom: "resnetv1pyr1_share_head_16relu0_fwd"
	top: "resnetv1pyr1_cls_head_16hybridsequential0_conv0_fwd"
	name: "resnetv1pyr1_cls_head_16hybridsequential0_conv0_fwd"
	type: "Convolution"
	convolution_param {
		num_output: 128
		kernel_size: 3
		pad: 1
		group: 1
		stride: 1
		bias_term: true
		dilation: 1
	}
	param {
	  name: "resnetv1pyr1_cls_head_16hybridsequential0_conv0_weight"
	}
}

layer {
  bottom: "resnetv1pyr1_cls_head_16hybridsequential0_conv0_fwd"
  top: "resnetv1pyr1_cls_head_16relu0_fwd"
  name: "resnetv1pyr1_cls_head_16relu0_fwd"
  type: "ReLU"
}

layer {
	bottom: "resnetv1pyr1_cls_head_16relu0_fwd"
	top: "resnetv1pyr1_cls_head_16hybridsequential1_conv0_fwd"
	name: "resnetv1pyr1_cls_head_16hybridsequential1_conv0_fwd"
	type: "Convolution"
	convolution_param {
		num_output: 64
		kernel_size: 3
		pad: 1
		group: 1
		stride: 1
		bias_term: true
		dilation: 1
	}
	param {
	  name: "resnetv1pyr1_cls_head_16hybridsequential1_conv0_weight"
	}
}

layer {
  bottom: "resnetv1pyr1_cls_head_16hybridsequential1_conv0_fwd"
  top: "resnetv1pyr1_cls_head_16relu1_fwd"
  name: "resnetv1pyr1_cls_head_16relu1_fwd"
  type: "ReLU"
}

layer {
	bottom: "resnetv1pyr1_cls_head_16relu1_fwd"
	top: "resnetv1pyr1_cls_head_16hybridsequential2_conv0_fwd"
	name: "resnetv1pyr1_cls_head_16hybridsequential2_conv0_fwd"
	type: "Convolution"
	convolution_param {
		num_output: 4
		kernel_size: 1
		pad: 0
		group: 1
		stride: 1
		bias_term: true
		dilation: 1
	}
	param {
	  name: "resnetv1pyr1_cls_head_16hybridsequential2_conv0_weight"
	}
}





layer {
	bottom: "resnetv1pyr1_share_head_4relu0_fwd"
	top: "resnetv1pyr1_reg_head_4hybridsequential0_conv0_fwd"
	name: "resnetv1pyr1_reg_head_4hybridsequential0_conv0_fwd"
	type: "Convolution"
	convolution_param {
		num_output: 64
		kernel_size: 3
		pad: 1
		group: 1
		stride: 1
		bias_term: true
		dilation: 1
	}
	param {
	  name: "resnetv1pyr1_reg_head_4hybridsequential0_conv0_weight"
	}
}

layer {
  bottom: "resnetv1pyr1_reg_head_4hybridsequential0_conv0_fwd"
  top: "resnetv1pyr1_reg_head_4relu0_fwd"
  name: "resnetv1pyr1_reg_head_4relu0_fwd"
  type: "ReLU"
}

layer {
	bottom: "resnetv1pyr1_reg_head_4relu0_fwd"
	top: "resnetv1pyr1_reg_head_4hybridsequential1_conv0_fwd"
	name: "resnetv1pyr1_reg_head_4hybridsequential1_conv0_fwd"
	type: "Convolution"
	convolution_param {
		num_output: 64
		kernel_size: 3
		pad: 1
		group: 1
		stride: 1
		bias_term: true
		dilation: 1
	}
	param {
	  name: "resnetv1pyr1_reg_head_4hybridsequential1_conv0_weight"
	}
}

layer {
  bottom: "resnetv1pyr1_reg_head_4hybridsequential1_conv0_fwd"
  top: "resnetv1pyr1_reg_head_4relu1_fwd"
  name: "resnetv1pyr1_reg_head_4relu1_fwd"
  type: "ReLU"
}

layer {
	bottom: "resnetv1pyr1_reg_head_4relu1_fwd"
	top: "resnetv1pyr1_reg_head_4hybridsequential2_conv0_fwd"
	name: "resnetv1pyr1_reg_head_4hybridsequential2_conv0_fwd"
	type: "Convolution"
	convolution_param {
		num_output: 28
		kernel_size: 1
		pad: 0
		group: 1
		stride: 1
		bias_term: true
		dilation: 1
	}
	param {
	  name: "resnetv1pyr1_reg_head_4hybridsequential2_conv0_weight"
	}
}



layer {
	bottom: "resnetv1pyr1_share_head_8relu0_fwd"
	top: "resnetv1pyr1_reg_head_8hybridsequential0_conv0_fwd"
	name: "resnetv1pyr1_reg_head_8hybridsequential0_conv0_fwd"
	type: "Convolution"
	convolution_param {
		num_output: 128
		kernel_size: 3
		pad: 1
		group: 1
		stride: 1
		bias_term: true
		dilation: 1
	}
	param {
	  name: "resnetv1pyr1_reg_head_8hybridsequential0_conv0_weight"
	}
}

layer {
  bottom: "resnetv1pyr1_reg_head_8hybridsequential0_conv0_fwd"
  top: "resnetv1pyr1_reg_head_8relu0_fwd"
  name: "resnetv1pyr1_reg_head_8relu0_fwd"
  type: "ReLU"
}

layer {
	bottom: "resnetv1pyr1_reg_head_8relu0_fwd"
	top: "resnetv1pyr1_reg_head_8hybridsequential1_conv0_fwd"
	name: "resnetv1pyr1_reg_head_8hybridsequential1_conv0_fwd"
	type: "Convolution"
	convolution_param {
		num_output: 128
		kernel_size: 3
		pad: 1
		group: 1
		stride: 1
		bias_term: true
		dilation: 1
	}
	param {
	  name: "resnetv1pyr1_reg_head_8hybridsequential1_conv0_weight"
	}
}

layer {
  bottom: "resnetv1pyr1_reg_head_8hybridsequential1_conv0_fwd"
  top: "resnetv1pyr1_reg_head_8relu1_fwd"
  name: "resnetv1pyr1_reg_head_8relu1_fwd"
  type: "ReLU"
}

layer {
	bottom: "resnetv1pyr1_reg_head_8relu1_fwd"
	top: "resnetv1pyr1_reg_head_8hybridsequential2_conv0_fwd"
	name: "resnetv1pyr1_reg_head_8hybridsequential2_conv0_fwd"
	type: "Convolution"
	convolution_param {
		num_output: 28
		kernel_size: 1
		pad: 0
		group: 1
		stride: 1
		bias_term: true
		dilation: 1
	}
	param {
	  name: "resnetv1pyr1_reg_head_8hybridsequential2_conv0_weight"
	}
}



layer {
	bottom: "resnetv1pyr1_share_head_16relu0_fwd"
	top: "resnetv1pyr1_reg_head_16hybridsequential0_conv0_fwd"
	name: "resnetv1pyr1_reg_head_16hybridsequential0_conv0_fwd"
	type: "Convolution"
	convolution_param {
		num_output: 128
		kernel_size: 3
		pad: 1
		group: 1
		stride: 1
		bias_term: true
		dilation: 1
	}
	param {
	  name: "resnetv1pyr1_reg_head_16hybridsequential0_conv0_weight"
	}
}

layer {
  bottom: "resnetv1pyr1_reg_head_16hybridsequential0_conv0_fwd"
  top: "resnetv1pyr1_reg_head_16relu0_fwd"
  name: "resnetv1pyr1_reg_head_16relu0_fwd"
  type: "ReLU"
}

layer {
	bottom: "resnetv1pyr1_reg_head_16relu0_fwd"
	top: "resnetv1pyr1_reg_head_16hybridsequential1_conv0_fwd"
	name: "resnetv1pyr1_reg_head_16hybridsequential1_conv0_fwd"
	type: "Convolution"
	convolution_param {
		num_output: 128
		kernel_size: 3
		pad: 1
		group: 1
		stride: 1
		bias_term: true
		dilation: 1
	}
	param {
	  name: "resnetv1pyr1_reg_head_16hybridsequential1_conv0_weight"
	}
}

layer {
  bottom: "resnetv1pyr1_reg_head_16hybridsequential1_conv0_fwd"
  top: "resnetv1pyr1_reg_head_16relu1_fwd"
  name: "resnetv1pyr1_reg_head_16relu1_fwd"
  type: "ReLU"
}

layer {
	bottom: "resnetv1pyr1_reg_head_16relu1_fwd"
	top: "resnetv1pyr1_reg_head_16hybridsequential2_conv0_fwd"
	name: "resnetv1pyr1_reg_head_16hybridsequential2_conv0_fwd"
	type: "Convolution"
	convolution_param {
		num_output: 28
		kernel_size: 1
		pad: 0
		group: 1
		stride: 1
		bias_term: true
		dilation: 1
	}
	param {
	  name: "resnetv1pyr1_reg_head_16hybridsequential2_conv0_weight"
	}
}



